{"format": "graph-model", "generatedBy": "2.17.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"0/observation": {"name": "observation:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "159"}]}}, "reward:0": {"name": "reward:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "0/step_type": {"name": "step_type:0", "dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "-1"}]}}, "discount:0": {"name": "discount:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}}, "outputs": {"action": {"name": "Identity:0", "dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "-1"}]}}}}, "modelTopology": {"node": [{"name": "discount", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "observation", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "159"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "reward", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "step_type", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_19", "op": "NoOp", "input": ["^step_type", "^reward", "^observation", "^discount"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Deterministic/sample/sample_shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_19"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Deterministic/sample/concat/values_0", "op": "Const", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_19"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Deterministic/sample/BroadcastArgs/s0_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_19"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/normalize_observations/normalize/normalized_tensor/Rsqrt", "op": "Const", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_19"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "159"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/normalize_observations/normalize/normalized_tensor/mul_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_19"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "159"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/normalize_observations/normalize/clipped_normalized_tensor/Minimum/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_19"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/normalize_observations/normalize/clipped_normalized_tensor/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_19"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/ActorDistributionNetwork/EncodingNetwork/flatten_2/Const", "op": "Const", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_19"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/ActorDistributionNetwork/EncodingNetwork/dense_9/MatMul/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_19"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "159"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/ActorDistributionNetwork/EncodingNetwork/dense_9/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_19"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Deterministic/sample/concat_1/axis", "op": "Const", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_19"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/ActorDistributionNetwork/EncodingNetwork/dense_10/MatMul/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_19"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/ActorDistributionNetwork/EncodingNetwork/dense_10/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_19"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/ActorDistributionNetwork/EncodingNetwork/dense_11/MatMul/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_19"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/clip_by_value/Minimum/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_19"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/ActorDistributionNetwork/EncodingNetwork/dense_11/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_19"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/ActorDistributionNetwork/EncodingNetwork/dense_12/MatMul/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_19"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/clip_by_value/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_19"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/ActorDistributionNetwork/EncodingNetwork/dense_12/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_19"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/ActorDistributionNetwork/CategoricalProjectionNetwork/logits/MatMul/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_19"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/ActorDistributionNetwork/CategoricalProjectionNetwork/logits/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_19"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Categorical_CONSTRUCTED_AT_ActorDistributionNetwork_CategoricalProjectionNetwork/mode/ArgMax/dimension", "op": "Const", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_19"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Deterministic/sample/concat/values_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_19"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Deterministic/sample/concat/axis", "op": "Const", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_19"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Deterministic/sample/strided_slice_1/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_19"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Deterministic/sample/strided_slice_1/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_19"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Deterministic/sample/strided_slice_1/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_19"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/normalize_observations/normalize/normalized_tensor/mul", "op": "Mul", "input": ["observation", "StatefulPartitionedCall/StatefulPartitionedCall/normalize_observations/normalize/normalized_tensor/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/normalize_observations/normalize/normalized_tensor/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/normalize_observations/normalize/normalized_tensor/mul", "StatefulPartitionedCall/StatefulPartitionedCall/normalize_observations/normalize/normalized_tensor/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/normalize_observations/normalize/clipped_normalized_tensor/Minimum", "op": "Minimum", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/normalize_observations/normalize/normalized_tensor/add_1", "StatefulPartitionedCall/StatefulPartitionedCall/normalize_observations/normalize/clipped_normalized_tensor/Minimum/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/normalize_observations/normalize/clipped_normalized_tensor", "op": "Maximum", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/normalize_observations/normalize/clipped_normalized_tensor/Minimum", "StatefulPartitionedCall/StatefulPartitionedCall/normalize_observations/normalize/clipped_normalized_tensor/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/ActorDistributionNetwork/EncodingNetwork/flatten_2/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/normalize_observations/normalize/clipped_normalized_tensor", "StatefulPartitionedCall/StatefulPartitionedCall/ActorDistributionNetwork/EncodingNetwork/flatten_2/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/ActorDistributionNetwork/EncodingNetwork/dense_9/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/ActorDistributionNetwork/EncodingNetwork/flatten_2/Reshape", "StatefulPartitionedCall/StatefulPartitionedCall/ActorDistributionNetwork/EncodingNetwork/dense_9/MatMul/ReadVariableOp", "StatefulPartitionedCall/StatefulPartitionedCall/ActorDistributionNetwork/EncodingNetwork/dense_9/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/ActorDistributionNetwork/EncodingNetwork/dense_10/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/ActorDistributionNetwork/EncodingNetwork/dense_9/Relu", "StatefulPartitionedCall/StatefulPartitionedCall/ActorDistributionNetwork/EncodingNetwork/dense_10/MatMul/ReadVariableOp", "StatefulPartitionedCall/StatefulPartitionedCall/ActorDistributionNetwork/EncodingNetwork/dense_10/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/ActorDistributionNetwork/EncodingNetwork/dense_11/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/ActorDistributionNetwork/EncodingNetwork/dense_10/Relu", "StatefulPartitionedCall/StatefulPartitionedCall/ActorDistributionNetwork/EncodingNetwork/dense_11/MatMul/ReadVariableOp", "StatefulPartitionedCall/StatefulPartitionedCall/ActorDistributionNetwork/EncodingNetwork/dense_11/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/ActorDistributionNetwork/EncodingNetwork/dense_12/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/ActorDistributionNetwork/EncodingNetwork/dense_11/Relu", "StatefulPartitionedCall/StatefulPartitionedCall/ActorDistributionNetwork/EncodingNetwork/dense_12/MatMul/ReadVariableOp", "StatefulPartitionedCall/StatefulPartitionedCall/ActorDistributionNetwork/EncodingNetwork/dense_12/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/ActorDistributionNetwork/CategoricalProjectionNetwork/logits/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/ActorDistributionNetwork/EncodingNetwork/dense_12/Relu", "StatefulPartitionedCall/StatefulPartitionedCall/ActorDistributionNetwork/CategoricalProjectionNetwork/logits/MatMul/ReadVariableOp", "StatefulPartitionedCall/StatefulPartitionedCall/ActorDistributionNetwork/CategoricalProjectionNetwork/logits/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Categorical_CONSTRUCTED_AT_ActorDistributionNetwork_CategoricalProjectionNetwork/mode/ArgMax", "op": "ArgMax", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/ActorDistributionNetwork/CategoricalProjectionNetwork/logits/BiasAdd", "StatefulPartitionedCall/StatefulPartitionedCall/Categorical_CONSTRUCTED_AT_ActorDistributionNetwork_CategoricalProjectionNetwork/mode/ArgMax/dimension"], "attr": {"Tidx": {"type": "DT_INT32"}, "output_type": {"type": "DT_INT64"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Categorical_CONSTRUCTED_AT_ActorDistributionNetwork_CategoricalProjectionNetwork/mode/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/Categorical_CONSTRUCTED_AT_ActorDistributionNetwork_CategoricalProjectionNetwork/mode/ArgMax"], "attr": {"SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Deterministic/sample/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/Categorical_CONSTRUCTED_AT_ActorDistributionNetwork_CategoricalProjectionNetwork/mode/Cast"], "attr": {"T": {"type": "DT_INT32"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Deterministic/sample/BroadcastArgs", "op": "BroadcastArgs", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/Deterministic/sample/BroadcastArgs/s0_1", "StatefulPartitionedCall/StatefulPartitionedCall/Deterministic/sample/Shape"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Deterministic/sample/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/Deterministic/sample/concat/values_0", "StatefulPartitionedCall/StatefulPartitionedCall/Deterministic/sample/BroadcastArgs", "StatefulPartitionedCall/StatefulPartitionedCall/Deterministic/sample/concat/values_2", "StatefulPartitionedCall/StatefulPartitionedCall/Deterministic/sample/concat/axis"], "attr": {"N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Deterministic/sample/BroadcastTo", "op": "BroadcastTo", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/Categorical_CONSTRUCTED_AT_ActorDistributionNetwork_CategoricalProjectionNetwork/mode/Cast", "StatefulPartitionedCall/StatefulPartitionedCall/Deterministic/sample/concat"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Deterministic/sample/Shape_2", "op": "Shape", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/Deterministic/sample/BroadcastTo"], "attr": {"T": {"type": "DT_INT32"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Deterministic/sample/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/Deterministic/sample/Shape_2", "StatefulPartitionedCall/StatefulPartitionedCall/Deterministic/sample/strided_slice_1/stack", "StatefulPartitionedCall/StatefulPartitionedCall/Deterministic/sample/strided_slice_1/stack_1", "StatefulPartitionedCall/StatefulPartitionedCall/Deterministic/sample/strided_slice_1/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Deterministic/sample/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/Deterministic/sample/sample_shape", "StatefulPartitionedCall/StatefulPartitionedCall/Deterministic/sample/strided_slice_1", "StatefulPartitionedCall/StatefulPartitionedCall/Deterministic/sample/concat_1/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Deterministic/sample/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/Deterministic/sample/BroadcastTo", "StatefulPartitionedCall/StatefulPartitionedCall/Deterministic/sample/concat_1"], "attr": {"T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/clip_by_value/Minimum", "op": "Minimum", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/Deterministic/sample/Reshape", "StatefulPartitionedCall/StatefulPartitionedCall/clip_by_value/Minimum/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/clip_by_value", "op": "Maximum", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/clip_by_value/Minimum", "StatefulPartitionedCall/StatefulPartitionedCall/clip_by_value/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/clip_by_value"], "attr": {"T": {"type": "DT_INT32"}}}], "library": {}, "versions": {"producer": 1882}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/StatefulPartitionedCall/Deterministic/sample/sample_shape", "shape": [0], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Deterministic/sample/concat/values_0", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Deterministic/sample/BroadcastArgs/s0_1", "shape": [0], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/normalize_observations/normalize/normalized_tensor/Rsqrt", "shape": [159], "dtype": "float32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/normalize_observations/normalize/normalized_tensor/mul_1", "shape": [159], "dtype": "float32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/normalize_observations/normalize/clipped_normalized_tensor/Minimum/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/normalize_observations/normalize/clipped_normalized_tensor/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/ActorDistributionNetwork/EncodingNetwork/flatten_2/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/ActorDistributionNetwork/EncodingNetwork/dense_9/MatMul/ReadVariableOp", "shape": [159, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/ActorDistributionNetwork/EncodingNetwork/dense_9/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Deterministic/sample/concat_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/ActorDistributionNetwork/EncodingNetwork/dense_10/MatMul/ReadVariableOp", "shape": [256, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/ActorDistributionNetwork/EncodingNetwork/dense_10/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/ActorDistributionNetwork/EncodingNetwork/dense_11/MatMul/ReadVariableOp", "shape": [256, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/clip_by_value/Minimum/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/ActorDistributionNetwork/EncodingNetwork/dense_11/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/ActorDistributionNetwork/EncodingNetwork/dense_12/MatMul/ReadVariableOp", "shape": [256, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/clip_by_value/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/ActorDistributionNetwork/EncodingNetwork/dense_12/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/ActorDistributionNetwork/CategoricalProjectionNetwork/logits/MatMul/ReadVariableOp", "shape": [256, 3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/ActorDistributionNetwork/CategoricalProjectionNetwork/logits/BiasAdd/ReadVariableOp", "shape": [3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Categorical_CONSTRUCTED_AT_ActorDistributionNetwork_CategoricalProjectionNetwork/mode/ArgMax/dimension", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Deterministic/sample/concat/values_2", "shape": [0], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Deterministic/sample/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Deterministic/sample/strided_slice_1/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Deterministic/sample/strided_slice_1/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Deterministic/sample/strided_slice_1/stack_2", "shape": [1], "dtype": "int32"}]}]}