{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"input1","class_name":"InputLayer","config":{"batch_input_shape":[null,null],"dtype":"int32","sparse":false,"name":"input1"},"inbound_nodes":[]},{"name":"input2","class_name":"InputLayer","config":{"batch_input_shape":[null,null],"dtype":"int32","sparse":false,"name":"input2"},"inbound_nodes":[]},{"name":"embedding_Embedding1","class_name":"Embedding","config":{"input_dim":65,"output_dim":256,"embeddings_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":null,"input_length":null,"name":"embedding_Embedding1","trainable":true,"batch_input_shape":[null,null],"dtype":"float32"},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"embedding_Embedding2","class_name":"Embedding","config":{"input_dim":64,"output_dim":256,"embeddings_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":null,"input_length":null,"name":"embedding_Embedding2","trainable":true,"batch_input_shape":[null,null],"dtype":"float32"},"inbound_nodes":[[["input2",0,0,{}]]]},{"name":"add_Add1","class_name":"Add","config":{"name":"add_Add1","trainable":true},"inbound_nodes":[[["embedding_Embedding1",0,0,{}],["embedding_Embedding2",0,0,{}]]]},{"name":"dropout_Dropout1","class_name":"Dropout","config":{"rate":0.1,"noise_shape":null,"seed":null,"name":"dropout_Dropout1","trainable":true},"inbound_nodes":[[["add_Add1",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization1","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization1","trainable":true},"inbound_nodes":[[["dropout_Dropout1",0,0,{}]]]},{"name":"input3","class_name":"InputLayer","config":{"batch_input_shape":[null,1,null,null],"dtype":"float32","sparse":false,"name":"input3"},"inbound_nodes":[]},{"name":"multi_head_self_attention_MultiHeadSelfAttention1","class_name":"MultiHeadSelfAttention","config":{"name":"multi_head_self_attention_MultiHeadSelfAttention1","trainable":true,"num_heads":8,"embed_dim":256},"inbound_nodes":[[["layer_normalization_LayerNormalization1",0,0,{}],["input3",0,0,{}]]]},{"name":"dropout_Dropout2","class_name":"Dropout","config":{"rate":0.1,"noise_shape":null,"seed":null,"name":"dropout_Dropout2","trainable":true},"inbound_nodes":[[["multi_head_self_attention_MultiHeadSelfAttention1",0,0,{}]]]},{"name":"add_Add2","class_name":"Add","config":{"name":"add_Add2","trainable":true},"inbound_nodes":[[["dropout_Dropout1",0,0,{}],["dropout_Dropout2",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization2","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization2","trainable":true},"inbound_nodes":[[["add_Add2",0,0,{}]]]},{"name":"dense_Dense5","class_name":"Dense","config":{"units":1024,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization2",0,0,{}]]]},{"name":"dense_Dense6","class_name":"Dense","config":{"units":256,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"RandomNormal","config":{"mean":0,"stddev":0.02,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6","trainable":true},"inbound_nodes":[[["dense_Dense5",0,0,{}]]]},{"name":"dropout_Dropout3","class_name":"Dropout","config":{"rate":0.1,"noise_shape":null,"seed":null,"name":"dropout_Dropout3","trainable":true},"inbound_nodes":[[["dense_Dense6",0,0,{}]]]},{"name":"add_Add3","class_name":"Add","config":{"name":"add_Add3","trainable":true},"inbound_nodes":[[["add_Add2",0,0,{}],["dropout_Dropout3",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization3","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization3","trainable":true},"inbound_nodes":[[["add_Add3",0,0,{}]]]},{"name":"multi_head_self_attention_MultiHeadSelfAttention2","class_name":"MultiHeadSelfAttention","config":{"name":"multi_head_self_attention_MultiHeadSelfAttention2","trainable":true,"num_heads":8,"embed_dim":256},"inbound_nodes":[[["layer_normalization_LayerNormalization3",0,0,{}],["input3",0,0,{}]]]},{"name":"dropout_Dropout4","class_name":"Dropout","config":{"rate":0.1,"noise_shape":null,"seed":null,"name":"dropout_Dropout4","trainable":true},"inbound_nodes":[[["multi_head_self_attention_MultiHeadSelfAttention2",0,0,{}]]]},{"name":"add_Add4","class_name":"Add","config":{"name":"add_Add4","trainable":true},"inbound_nodes":[[["add_Add3",0,0,{}],["dropout_Dropout4",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization4","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization4","trainable":true},"inbound_nodes":[[["add_Add4",0,0,{}]]]},{"name":"dense_Dense11","class_name":"Dense","config":{"units":1024,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense11","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization4",0,0,{}]]]},{"name":"dense_Dense12","class_name":"Dense","config":{"units":256,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"RandomNormal","config":{"mean":0,"stddev":0.02,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense12","trainable":true},"inbound_nodes":[[["dense_Dense11",0,0,{}]]]},{"name":"dropout_Dropout5","class_name":"Dropout","config":{"rate":0.1,"noise_shape":null,"seed":null,"name":"dropout_Dropout5","trainable":true},"inbound_nodes":[[["dense_Dense12",0,0,{}]]]},{"name":"add_Add5","class_name":"Add","config":{"name":"add_Add5","trainable":true},"inbound_nodes":[[["add_Add4",0,0,{}],["dropout_Dropout5",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization5","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization5","trainable":true},"inbound_nodes":[[["add_Add5",0,0,{}]]]},{"name":"multi_head_self_attention_MultiHeadSelfAttention3","class_name":"MultiHeadSelfAttention","config":{"name":"multi_head_self_attention_MultiHeadSelfAttention3","trainable":true,"num_heads":8,"embed_dim":256},"inbound_nodes":[[["layer_normalization_LayerNormalization5",0,0,{}],["input3",0,0,{}]]]},{"name":"dropout_Dropout6","class_name":"Dropout","config":{"rate":0.1,"noise_shape":null,"seed":null,"name":"dropout_Dropout6","trainable":true},"inbound_nodes":[[["multi_head_self_attention_MultiHeadSelfAttention3",0,0,{}]]]},{"name":"add_Add6","class_name":"Add","config":{"name":"add_Add6","trainable":true},"inbound_nodes":[[["add_Add5",0,0,{}],["dropout_Dropout6",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization6","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization6","trainable":true},"inbound_nodes":[[["add_Add6",0,0,{}]]]},{"name":"dense_Dense17","class_name":"Dense","config":{"units":1024,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense17","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization6",0,0,{}]]]},{"name":"dense_Dense18","class_name":"Dense","config":{"units":256,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"RandomNormal","config":{"mean":0,"stddev":0.02,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense18","trainable":true},"inbound_nodes":[[["dense_Dense17",0,0,{}]]]},{"name":"dropout_Dropout7","class_name":"Dropout","config":{"rate":0.1,"noise_shape":null,"seed":null,"name":"dropout_Dropout7","trainable":true},"inbound_nodes":[[["dense_Dense18",0,0,{}]]]},{"name":"add_Add7","class_name":"Add","config":{"name":"add_Add7","trainable":true},"inbound_nodes":[[["add_Add6",0,0,{}],["dropout_Dropout7",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization7","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization7","trainable":true},"inbound_nodes":[[["add_Add7",0,0,{}]]]},{"name":"multi_head_self_attention_MultiHeadSelfAttention4","class_name":"MultiHeadSelfAttention","config":{"name":"multi_head_self_attention_MultiHeadSelfAttention4","trainable":true,"num_heads":8,"embed_dim":256},"inbound_nodes":[[["layer_normalization_LayerNormalization7",0,0,{}],["input3",0,0,{}]]]},{"name":"dropout_Dropout8","class_name":"Dropout","config":{"rate":0.1,"noise_shape":null,"seed":null,"name":"dropout_Dropout8","trainable":true},"inbound_nodes":[[["multi_head_self_attention_MultiHeadSelfAttention4",0,0,{}]]]},{"name":"add_Add8","class_name":"Add","config":{"name":"add_Add8","trainable":true},"inbound_nodes":[[["add_Add7",0,0,{}],["dropout_Dropout8",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization8","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization8","trainable":true},"inbound_nodes":[[["add_Add8",0,0,{}]]]},{"name":"dense_Dense23","class_name":"Dense","config":{"units":1024,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense23","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization8",0,0,{}]]]},{"name":"dense_Dense24","class_name":"Dense","config":{"units":256,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"RandomNormal","config":{"mean":0,"stddev":0.02,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense24","trainable":true},"inbound_nodes":[[["dense_Dense23",0,0,{}]]]},{"name":"dropout_Dropout9","class_name":"Dropout","config":{"rate":0.1,"noise_shape":null,"seed":null,"name":"dropout_Dropout9","trainable":true},"inbound_nodes":[[["dense_Dense24",0,0,{}]]]},{"name":"add_Add9","class_name":"Add","config":{"name":"add_Add9","trainable":true},"inbound_nodes":[[["add_Add8",0,0,{}],["dropout_Dropout9",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization9","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.00001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization9","trainable":true},"inbound_nodes":[[["add_Add9",0,0,{}]]]},{"name":"dense_Dense25","class_name":"Dense","config":{"units":65,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"Zeros","config":{}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense25","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization9",0,0,{}]]]}],"input_layers":[["input1",0,0],["input2",0,0],["input3",0,0]],"output_layers":[["dense_Dense25",0,0]]},"keras_version":"tfjs-layers 3.20.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"embedding_Embedding1/embeddings","shape":[65,256],"dtype":"float32"},{"name":"embedding_Embedding2/embeddings","shape":[64,256],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization1/gamma","shape":[256],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization1/beta","shape":[256],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization2/gamma","shape":[256],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization2/beta","shape":[256],"dtype":"float32"},{"name":"dense_Dense5/kernel","shape":[256,1024],"dtype":"float32"},{"name":"dense_Dense5/bias","shape":[1024],"dtype":"float32"},{"name":"dense_Dense6/kernel","shape":[1024,256],"dtype":"float32"},{"name":"dense_Dense6/bias","shape":[256],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization3/gamma","shape":[256],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization3/beta","shape":[256],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization4/gamma","shape":[256],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization4/beta","shape":[256],"dtype":"float32"},{"name":"dense_Dense11/kernel","shape":[256,1024],"dtype":"float32"},{"name":"dense_Dense11/bias","shape":[1024],"dtype":"float32"},{"name":"dense_Dense12/kernel","shape":[1024,256],"dtype":"float32"},{"name":"dense_Dense12/bias","shape":[256],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization5/gamma","shape":[256],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization5/beta","shape":[256],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization6/gamma","shape":[256],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization6/beta","shape":[256],"dtype":"float32"},{"name":"dense_Dense17/kernel","shape":[256,1024],"dtype":"float32"},{"name":"dense_Dense17/bias","shape":[1024],"dtype":"float32"},{"name":"dense_Dense18/kernel","shape":[1024,256],"dtype":"float32"},{"name":"dense_Dense18/bias","shape":[256],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization7/gamma","shape":[256],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization7/beta","shape":[256],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization8/gamma","shape":[256],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization8/beta","shape":[256],"dtype":"float32"},{"name":"dense_Dense23/kernel","shape":[256,1024],"dtype":"float32"},{"name":"dense_Dense23/bias","shape":[1024],"dtype":"float32"},{"name":"dense_Dense24/kernel","shape":[1024,256],"dtype":"float32"},{"name":"dense_Dense24/bias","shape":[256],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization9/gamma","shape":[256],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization9/beta","shape":[256],"dtype":"float32"},{"name":"dense_Dense25/kernel","shape":[256,65],"dtype":"float32"},{"name":"dense_Dense25/bias","shape":[65],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.20.0","convertedBy":null}