{
  "format": "layers-model",
  "generatedBy": "export_sac_to_tfjs.py",
  "convertedBy": "Custom SAC to TF.js converter",
  "modelTopology": {
    "keras_version": "2.13.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "stick_balancing_sac",
        "layers": [
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_0",
              "trainable": true,
              "batch_input_shape": [
                null,
                4
              ],
              "dtype": "float32",
              "units": 256,
              "activation": "relu",
              "use_bias": true
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": "float32",
              "units": 256,
              "activation": "relu",
              "use_bias": true
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "tanh",
              "use_bias": true
            }
          }
        ]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "dense_0/kernel",
          "shape": [
            4,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_0/bias",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/kernel",
          "shape": [
            256,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/kernel",
          "shape": [
            256,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/bias",
          "shape": [
            1
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}