{"format": "graph-model", "modelTopology": {"node": [{"name": "x", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "16"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "angle", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "step_size", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "fire_rate", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAwAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAABAAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Greater/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}, "floatVal": [0.1]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/stack_1/values_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAAAAAAAAgD8AAAAAAAAAAAAAAAAAAAAA"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAAAAAAAA+AACAvgAAAAAAAIA+AAAAvgAAAAAAAAA+"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAgL4AAAC+AAAAAAAAAAAAAAAAAAAAPgAAgD4AAAA+"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_2/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAAAAAAAA+AACAvgAAAAAAAIA+AAAAvgAAAAAAAAA+"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_3/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAgL4AAAC+AAAAAAAAAAAAAAAAAAAAPgAAgD4AAAA+"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [3]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/repeats", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [16]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Reshape/shape_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AwAAAAMAAAABAAAAAwAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [2]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [2]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [3]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [3]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "sequential_3_1/conv2d_6_1/convolution/ReadVariableOp/resource", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "128"}]}, "tensorContent": "3nOFvUg64T29Nyi+NwIsPZBUJL78mbe90KlOPVgu9D3kTpU9UhFGvtFfuzste1G+QLPqPPd7zjqMMIQ96BUxvZexC716T3C+dICAvrMgT75UwxG+nkVxvEdZX73xPlQ7ckMCP/hM0L0qxxk9hJ9NvuanXb0M9iO+hxI2Pn5XBL6SHGk+7rahO9C7Ir7zoaq9UofWvaCkMz0HcvQ9xz8dPqngi73lv889xhuMvS0iSr3Y/C++LAKqvcZzRL5RFD6+qX54vdnzZ70ZYr89wb2ZvinXLr4s0Zm6ekdDvjzBGL2I3BQ+9Zp2PiX9Mr1bUE2+Zv9bvZDH4L1yepU+8D0yPn4mm74B9sk9TCtevnon8L0VwgK+knzTvT4kkT6Y9B2+j+SivZAQlb0F/vq9xH84vhf1Gj2jdv28qUUcPGx5570gjFS+UbhHvU9w7z0JJza+gEX/OyUCorxqfLc9wDQ3vQFYSz2/d86+5eeovqyPBD7UBxk+b05EPh7rOLwHUH06sLKMvIvq572sPLm9XFfHPfgD273K7g2+jXw+Pf6z0L3F9Tc+q56QPayRI75JlcK9ZQaGvoNQOr5yIKa97VTDPOudiD0FuBu+FKJIPqu42r1qcIG9AXskPvjSEb6gjxW+MumZPccybb4JLcQ91YR4PuFE6TsZye28gFApPio1zr2Y1Fy+v2TWPfzkR76UM6I9z9cavncVrj3WPpM9zSKUvawJIz7xjQU+M342Plh11b10bok+n4sKPlmsDb79wAg7mycaPiNMuT36Hge+swhvvkKfWD0C7+m9ZZhkPSCDQ75VZq+95FavPdupOr00doK+ihkSvvbMzz2xGiq+b4tvvceJdL2MK+W98axhPoxSJ77RTEu+BxULvYW4Vb43K189r5BQPsTGEb4Nrf49vSUbPmktB75k44Q61KeEPfSZTr1Jtp4+VQWBvVt8GD5d5hO+uX0mvvJssT0DChW9QlAQvVyVPj6Yk3i9CNi+PDHFBb6EDtE9yxrKPXNSpL1euW0+kthdPXEraj4RG2c9ZxtbvHHeSb7lmFq9a8fuPc+QXL3SWh2+bOxDPtGh7b33+lk9sVhQPm096z0/vSy92QkWPseIOrw90649CGJFPvHnWb09fpm8CjGFvbkW9708Ndq9bZDbPfb0TT3CF1s9E7gCvWNqh71C+y++NsJmvTRgSz7tRh6+8SsVPRaLDz6Bigs+OykpPQ5h6b1oSTO+wtm9vfWKEDzyoNa7WByuPNT0R77hiLm9dLE3vousmT39FzO+54Ggvc/kAz0cHps9FGUqPc+JMb4mPjU8/9CAPvBQgL01m0A+1MovPjeDDru00to9bd+BvT5kbD19Deg9CNpRPtutaL3GlAU+OryWPDdDXb1Ma22+dgNQPYmzLb49b6w+0QVpPnoumL7XQCm+w+jDvPLW6r2yrh0+LEu+PaQ/lr2QuEs+UHfbPaQPWr44qns+sbQQPs6siL5J/ia9nJC8vTZjCD7I16w+3S8MvG5hRT4QKyE97J8TPtWhjj1KwYg80kOoPRs+hz5ZYgy+j5gyPoyEhb3xtjk9JF/FPSGvzr3bh6c74uI4PsgsKL2m0pk9aegGvcI2EbyIovS9GNQYu/I+sT19lrO9UiepPXbAGTyfNia+P/8IPoa3+TzThwM+fG4GvqeSED3jV329leAXvX/iXT4CoJc9EmkePmUcwz1YPde9Jte1PREw6D0vsaa87KvRPRuhPz7BvTG+AjZgvpNErz1EIdG9G5I9va1elT5f+mk9xKUyvWsJZj5z5X+9IfBoPXLCDr61qq29mgF0vZvB9r0ooYQ9dAeUPdw/nr7kQSA+zDQDPvOu3LvzFGq9Mxn0vAf8NL75IPW8BwItPoFHfT1R+uo9bpoAPpfk+L3Rbxq+ayHAPRRoFb7hS1k9UH5WPkH53j1gXsA9f16yPbltkz2S6jy8XFidPcq3Yz3SZHa+wX9svrRasj3wfW69XzSBvUZPND2g64+9iM+RPkJCSL42v5k9kVpYvswJ5r3LK1C9g5+IvJVLWr7ZJDo+79iTvSCzV75t/L09JMQwPvhElL25qye+qrDFPTzFIb5sVOE9IT6yvFHHMD100JU88UbYuxAU/71NXci9p767PXYHL71dy7w8zT1Bvqk6VDt/uUS+7965vMuMsD3b3Bs+t9huvhLFpT7WraM9zvzQvQ21n71uvuq9qKNPvpYyrb1JSao+qfEmvuQtl7u/2Yy+5E9yvgPDo70DOB2+MO0Hvm22rL3dAEY+RGtCPKgPpD3tGW49CefVvbKnQb5EeT0+hLluvoGOkb29zIq+vKXBPMerjz0gDho+FZ1Gvub8Jz02FNm850XUvmCa+L23i7Y8oz8avtoDy72bidq9ZoqrPpOsPL2dP16+7U4LPl4iB76B3Iy9rmEBPrkfeD6KnVm9qmISvhQgWj0f6vm9fdXGvXGsEDsrbSS93DImvi4ENL5pUiI+nnsPPoktv72Tkx0+CaZdvmtPCr6oah4+AGFHPBX+kzzbEoG+6qp6vsNqOz4AMxA+pMiyPWKGDj5NuDU+JCnuvWdJXz3w2su9dd39un3uED7qebs9Zb13vW/PAT4+4S0+Me9uPW7rnz58FN88WFEYveSg471+N4m9sR/fvYYDG72FUXQ9Jzx/vu6uVr5K1YM+DQpnPhmK9b0tUoQ9a3u5vSgiC7192LE9X39IPm7WUT4JysM9eLZoPdmdIL7Tkfa9A3ovPTpnG7527+a96LARPrEqU73T1z28eA2QPtywcrxhKVK+3QiGPQsYib0In9W9zAMcPuUcSL4aMp6+YXO4Pmh4eD3dDvO9cnSzvTvIdrwEXqk+rmXAvdC37L3GY4W9a09jvlo6GL5S5tM92Mgpvh4ptT3BIQO+agslvPjEIz6Z95I80BgqPr39Rr4y6zW+YUxpPmN3kj1deBy+wBEvPb/+fb4Ihua9execPaObizzXycA9VeufvYMGrD2BDss+CbuEvZMSETwFPRc+2XdKvt3tTzyAzpu+cFyQviAaKL5664Y+MzNBPbWw770OFXy9S/osvuUjTz0fsMI+7PrMPXScgT6ZKh6+LEiEPgx3bL4RdaM9ICRIvoEK5j2h2TQ+1uaxPh72cj6g+hG80SQGO9KbQrx7pxQ+Ltzlveb7wz6KMdY9RKZuPtqwP76ZgAi+iPpgvgwVAb1oehC+YaFUvl1UoD1/djs+oGNmPi71AT4yJAy9gpJEPuFAdryqYBi+dUNmvce8Gz3o0Zm9hAjevd3bbDypOxG+VneIPBqs3Tz2K0G9rA3nvTvPAL/5NFg9kf+OPI/uFL1nr4o9IAAvvrFFNb6BDGO9PR2hPSK3Y75e0Be+ryXiPcU+tT0XIbK+cxOIPaKZJb6f//k9KBC5PAid9bySYF69YahbPvBPAD0CQkU+lzuSPan3qT1jyfi9HZopPTPuQL0RS8s9QAIDPr1qtr2kPm6+Hb1dPewyhj2FEVC+LKB0PSq1Dj37ZCQ+b6sMPbJySb4uAH29DA8CuyfbWL51kYU+LtmPvt5kSryHDTY+qrAlPgSqrD6mhpk+zNA1vmVmnT2IaBg9Z//sPb0bwT02fWa+BQErvfsg6r27QDi+HkFHvtYt8L3MZjO+gDKFPZSH9TxQ0U09gWKDPnNeZj5AVGk9zeyIvb1HbT1qp749g1+OvWU+Xz2ygui9toLDva0iXL61UBm+G8aDvSQ7Hjxk54k9thv0vXgC1r1r7ES+adqgPYCGrb79kmU+EO/xvR/LLz5d2W89ANomvi2RjT3RpEq83ZV6vfXwjDyVghW9ngCAPYbegj7LgTg+X13yvWhqnr0Md4S8oe5ZPak4iL1HAni+BzYJPcI61r3HZQo9fvOSPaojF74mtlU+u5mzPG1A3737PFq+ldervcxMWz0zudy8yNMcPl9reD08q7k+L4kmveTG3j3yNyc+UMTGPFnWUb3h1ZE+8uFYvlFjKD034mI9kMBBPmORNj4+CYo9U5WuPbxXkz2rGNM9fnBdvUmzr72+EVq9i5eivlsDuD3TwLk+lit0PsVShL51Sww+e/7sPL6JTb43nna9L551PN/UuDxA8Zk+lpotPElwCD15QwK9JL+/PcSygT4D6F++HJYFPk0PyryinxO+FvMZvmG7fjvrYCK+HhsYvjttlr1yErG8pFuzPUcIOD2mwY+9qg1Yvtc7qz1k3TQ9Le+NvpcNhrxMptm994civlW9oT115n8+XZUJPjsHWb5z4/I9ETkfvhz0oL34IbW+W5Z4PCFkib7KgHO+ijZOvno2Tj00LEO+xHzgPKELbDyRo7+9LQgUPaYjJ74LEMQ9+yplveZyAL59eYE+HMHZO4dBxj2hS8W+YrhKvWMdNL0wyE0+BiU3vjhpor689r09Kf6VPpkxs738KUa+m/99Pv/41D3XvE6+cDhYPlXPLr76CAs9cmoTvHIf8L1rEiO9i9b/PeDpCL8cnV095M3dvU9aAT6KIi2+KvaUvcfqib0KIrS9pDe5vc1aNr7LVL49c6iEvqLEFj7vASi+EITFPYpFzTw6kSu+xp5jPbYWkzw5Qni+qeOSPlpNkb4KAle+/5qHPVGQLz7QnAM+uzUIvkgK5L0ispA8e5vXPMBeTT1+s4q9uBi2PZ+r2b4nPTk+2qRFvrQdQz351KI+qs8VPnoVgr23v/K9XgsjvtYI5bufqm27cS8Avr9VwT3MY549GIPcPdhUD71SFAk9Jg4wvBvWlT0J5EY+FbQJPhX4pr1Y0e69i5JBO0rkSz4OfkW+0hvsvZABvr0A6z2+8ZdbPr0Csb3lMTO9PgUEPm58Cz7pIkW+lM93PmJDK73hack9YODwvI2zbL2UJSK+1FuQPoin1r1avQW+SfryvRt/4r2xmj0+ao1mvp8LMb6u7/m91vpzvdJI2b32qnc9F9mBPkEBML69S709IiYevmGxeD5jo16+xtErvRVx7b3yrYs9bfYMPg0vDj7BJMS7mXrtvZErvz3KEUE+PseFvcGq871xrVE9rBaEPiV0Cz4WY6Y+W54cPSAWez3YaYI9lreCPLdVnb2lNa2+439cvQ8UOT62mgg9f5DcvUYTCz3yOp89zX8wPmxzOT5MpKk+JOG+PNlvRzyUSiG+FwsxPrjhjD1Ta8699mL3PHVTyj39lQg+z7fxPqNz8z2wwW67zi3zvBvh5D34AJk+6P5KPHzpKb61M0M+OEV6PqdS47zuAQQ+kjIevmwaPr4/Uje+eZsYPW6wG73KIpU+V3n4PGeNuj1+Hx2+IcLiPU5dvTwqSZA9o8pWvRXzgb0A9nY+z95UvmTaKL77vbs9ChQTvqNLe701aZG92MwkOzvYZr4b2wu+axPQvY9hCz2swbO8+dFuvB3+JL407eO9HKoQvpEphr0gwH++reodPkG/+jxKfwu+g2J/PY37qD118Io+6L0KPrOS6bwoxmk+YAORPeoT5L2QQgY+4AYYPmPwiLxJXdU8YuPevIOAILyoZUQ+p+f/PNt63b6rdzK+0DmKvc0kmD2Jf8A964FNvmUQAz4h6/o9wKHovZSZbL1fUH890DwivFe1475SzqI9cYvXvZEQBb4my4w+3Jv/PeO4iD5nNms+/PjRvSHHm7zw+5c+EfOZPg50KD2dOeO9M7gqPoOqQD5aXem+O7wkvu8beb0kI/k9wrYNPha9gDxu2le+aUJxPn1wkT0MqNG9UTj+PZ38xr3p7ts9C8fyPdZIGj7Hypq9DN5Cvru6Kr6OELq8JwTevBR0NL5Tf4W9xY/mvWtglz4Q4Eu+nnVkPpsLL748wIw8/+JCvq4O3T1Xyt09NP6lPW+h4T1+2T09DjA+Pe3597yzRc6++HITvrOAAj5WbHY+QQbePWhcuL27UdE8VXdjvLnpYb7J/Km9w+kEPlgWwL23s/69zFXJPcsiGL75Etc9JaZevuviMr7WJKE8H53fvSTLhb5/Gqu+ncDlPZOTYD4UF84+G7QnvTYXD70jaag+RbAFvSsRTr7XJPy9AcxYvmCJqj1XVRQ+bKoPvb4mYj2akPW9VN/TPbFX4LsZqOi96Ef+vWOAFz7NuRM+rumhvidyOb5wb/s+J1GPPv32hr6JEmc9cIwDvmxOzDzao6w9K/ApPnkaWrrldOY+Sa9Cvn2INb4rHfS8VXanvGoPq755cA0+jEkWvqM4LD3GnFu+h/AivtevJb6G5C++gUe8vNVA8733i5g9NwUsvjdWpr1n8g29/aH2PACdAT2HbVs8D6BePbpiCb7U8ey9DVMbvoED+b3zlja+2f2HPYT5JTye6yu+1wvJvcUAAL4XqGW+esDFvXGxTL7UNy89kdgXvXb0mb3Yspo99Bb6vKRpbj2yY6S9LHIkvkewGb6Omay9oc5CPR36wz2FmxK9mY32PGT9yj06Jck9G3iJOzpPjD0Ftb88nzrzvf/fxzzsCXy+lP7mPf5m472xvnQ7QSTJvZjHDL4gSDY+srj5vYXETr06lkG9sWLDPWG+Zz6Xje09JPdfvgeKv7pIix09hHBivTTPmL1QGD++FHHOu89ErT1YJAa++j/xvHNYxr24Kxc75yytvRaV773wiA88m7RpPYPu4L1O/bC963DrvSe1JD5lNN++33E7vsPMP7yEDYq+ouWTvqTkK77JkEG9V6LLPXlpyz3E9hG7jMiavYbRPb0D7Kk+0OsGvgk13z36pZW7LzAuvIzQCT5/zgq+qbOdPSx2Jr6uGhG9B6vpPQ/gcL600Q6+/xhgPgGg4DyXvYO9aK5BvlBYWj3KFQW+46L7vVPfLz5PAwi+YcclPkrRTL6HCBi9K7UVPH2MHb69GbI+qic0vtT1AD6Yehc9wW7RvfHGtD3JuOa8/70wPtC89T1xB5K9OwNnPrAOhL6ZKVK+TmPmvNw1+b0H8CY9Ebg4Pha+5D2EDfy8gwgavn//jz2W4Fo96YIFvgzczbzCmTq7ICh8viczFD7E4pe+1u6+vblH/D0brUA9fbhRPXb2ML6ughE9g7oePs4l5b02C4C9/p/YO8iGUr7L7Yy+LSr4vdX7jD2yKh0+zf2fvTCp8LpT1XY95PGUPYsqoD3iWXY+wCNSPvHiVz326H69GQ8QvolbnD2ZSlm+T9f4PCfgwT2MRVy8Zb1qPkkcTL6wpm08gaB4vVaoJb47Df09vlSMPcFriT4Qdqc9nlJJvmnFeD1rYB29L+vLPbA2Ir3tYgY+96MDPfn8lL6gVYG+pi/avQoJAr6k8cq9ON/hvWdRzr2Xz1Q9cb6TPRzQRb1/mw8+j3I/PoXwDzue8CK+79/7vS12Kz7BXqG+YG1lvn0yOb63aza8eBnGusKNnjv7NUk8wGmTPAfI7D1Vare7aRIYvrPmYrwkGKw9tvZkPij7Tj0KKb69LVCvO9pItruDYPC7sJ1gvuPf1z1wIQQ+140OPk7lOD4MIvM8em8Sva9o2jx/Jjg+nbASPs79dL7gZcy93Z6mPVaDJL6BtX4+wP+zvHnEkz1bY909Ay8MPmIjDT4yUtu9xewxPko+zL3EHA++ElMtPvihRT7ke4w+EfKhPa0ruL5DyOk9GiJWPrj/Fj6rEkE+M7h1PRHbEr2Zze084yURPiA28b00WSE9SKYmPYOg+T2AGnO+vro3PsYI0zz5GFO+n9ucPrWYEb7mHGS+9/OsPIWQcDyMkSI+5bN0vusQij05y5O9zaS6PZKgAz7b4ws+PEw/vuiyFz6nT5K+6HWyuqyAgb2X7U+8J0+svdnKpj0j1yO+6VE1OnVbSD3hMFW+2KnUPDKRNT4cfYo96Sw9Pr4Qmr7C1H2+YIeVvavlgr5y9yS+C3+IPUnLkD1hBzY8JflPvr+XZL6jici9U8ypPNaSnr1eeF09oIY0vvdQN76pJSq90JN7PAuIGz67TpY9IZ0Nvp0kEz1LySO+UtE6vmBJWr33xP89UbbavqtI3zymtSq9FvskPm9HFT3OYMO8fGc0PLEuBD5SwUa9rl1EPXiiDL52oVU78ZgrvujrIb220nI+tRqDPfkdEr6LIJy9KcrwvAna/T1/pE+9pVrYvR5QGr5+uWy9HJFUPoaQoD3uKwM+MQ0bPkJJiD3CLuO9MtDfvM6Rwz0tska+ld0YPlHTqz7FTji9lA6EvQaJFb7Xumq+I2Gju1IInb0RKoA9Ez6cvUaLrDxrssk9/3B2PhjOKr4WG6u+a8GhvVEtdT3E3R09Kl6kPQ9eCb7G3Jk+HGj+PRp7Gj7RLyc+zCSaPH8X0j1FmWw9QbupPcXxiD5PnaG8+NjZPBP6ZD1K6vk8NK/SPR+Jc70DOJq8GykJvpwliDy7EXa8bVBiva7Kib0qG9K8JByQPdkm/j0O7xY+ldwjvgT8gj71sLU9s0GTPWWamT141t+8fRwLPtL6Ab0xsck9pJvBvZllBD7VgeY9JnkqPu80CDzwJLa9hiMXPirRQD5qjOw946rsvXqqWz6Zz/M97KHzvcZ3qL3tyJs9NRUSPR4DKb1BYvA9mMGevb6sxj11sLa8q9NrPtCSoz6ZdP48ctyhvR94az7phV29PCMNPjGEqD0qmzI+9XaHvUJIAL6u58+8GKqiPW6I4TzX5GA+NFLmPpLAir3KmLu9wxZ8Pb6ndj3EKsq9BWjAPcUL5T3YzDO+XVFdPaV/sz22R7E9xq9GPpXq073kszI+aSIvvk9gqT2dmxO+RAgYvnunzrwjoWa8GvCIPY1enb2MKLs9C64/Pnfb4z1B3A66AlzzvJ9eDz4Rfy4+/TDFvf1rGzvOmD+9tXUoPnFLlT1sXIc8CT/dPZpd5r3l8wA+Whs2PUTTFD4Y2BU7TKdevRPgpj1pINM9ZSKpPMe6t70ZXwA+vtOwvRAiGz5v2Fg+1TMTvj+Ktz1qPOY9pg6TvYKCCD6mWAY+501YPuMh/b0yZvK7anmPvbp8Yz3LUEO9OMLAPFmtAr5wVoi+8vMLvusizT6MmGE9aquEPaRigj6zhO893x4Qvvud5L2zKXa9L2kGPnSSUT4yBXo8Cc4Hvv7mj7wb8SE+CliHvkLYgb5Nfb89J9thPkcuLj5f5AM+NUmvPYvXiT7qXrg9cNwavj1fcT50LPy8PaoxvurDEb4DZ4U+YSWdvIEKZz269Fo9YoEsvq0ZG74Mmgi+WxARvoJZKD2aXQC+JzuEPm18yD2kk+Y9b59APldT1z1cucs9DAoTPk1QxT1BBqA+Q/kWvecHKb3foAy+CSm4vZ7HIrwY8Rk+WCHKPRCKc77m9LW92JgKvtQfUz4KIpi7TSExvsPdRz5GOZG9dTrlPV97jD6bz2w+Xuh/PXjdjj4D/fe9t91ivuAaL75JDJG+8QH2PZDyTL6KuLU84qzZPaLOijzAMc29LdgFPaa61byFq2O9OdDTPRPvnzwqcRY+80XovKFvZT514me+FUaePkglaj6TOve9SoDhvRFOZb2Vtem6gmEYvnhh1TzhZk2+5DTiPSxVmj4nM0a+xl+TvVFJAj6pvNq9YRf5PgkpMb3j3nM+ySCuPCg+Kb0EEN69cNsyvo6nbz1qz9e8bxUkvbT3gz5KFEo9g2KUPbiwNj0ltIg8df63Pcfeir2UZYk99sPhvEwpwb111W8+mX3NvVs2iD3qaLc9KksNPl5+mDuGS42+6yTuPJPOb76Mo1Q+GQCevoSdUj6Qo1i+bTuWvi/3CT76R7A+Yu1xviYLcL6Pou+9pfChvYktiz7yAXc95HYXPcs3qb0gxwU9KCILvlqJJ76hN4O+jp00vmG02r1W98+99nHSPQaDcr3+/e29jUWLPUvZvT7+11Q+Bq9OPfqi8b0pNcE9/sM/vtrTOjyMWIq9a6L9vd8kgb4ncUQ+jaxnPi+yEz1n8F8+1RPzvUyjSz5/I5G9UqIcvjslmbzOXl69xp2pPUpODj7W6yY9vkkIu3yFLb4CP4W+zNeSPJ0IKjwXmpw9q2bKPNH5+by+nY8+18Q0POGqj7oR8TS+XSIpvBkckD7CyYA647HAveq6/b1KLgE97llKPeLphz5fVgO+uxIPPo9rHD1eCTm+juj5POO1nDw33MO9CV1dPXFnwz0UQ8K9FGoMPm5tiD4zsm4+IKjAPTZWGD16b/G9HwQmPTgB9T0MbSi+762Rvr17q76UEja+3IMPvgj4F74lmK498TgxPaw5sr1ZRjk9eOyfPQfksr2ujL89XOwuPtTj/z13JK+9cKSrvP4rV75rk9i+FftFvg9lWzz4cMM9AIMdvtZpYL0jARW+Cj2pvelaVz4mdKm94umiPcDxBb3WIUo7/eimu3k5671564k92/zvvXAzhD6Hvh4+yY6PPnpQoD1oXIA9x3eUPsLzKT0FKT0+TG+VvWYMjj2LFE0+Rwdivt335z1YXNa9Xti2ve6Ap71nZxO+2U2vvNYIED390gE+OFxYPVkjjj1q/RK7TrCqPJa6lz3A2RO9MJ0OPlG/dL1UXaY65libPltS6b35B5M+3YSIPPx8yb1rFdg9WfSAPCGN1j7VxnM+RGQNPpBqHz6TN7A9efnjPV2iuz0+i4s9XbZivpUL/bwXlJ87hU8sPcm5Qj47To09TfqRvfFG6DyJHHY9AFULvSob2D3gmd+8M1NwPqb9Ej7UVCA+lA0HPhu1rT3q9FY+x27juhHKMD2R3nu9wbWlPljvHD4xgA8+LbAgPUyX8z2Gdxw+vX+8u2F00bw/sc88oUFZPvEs4L2O0Du9rZLvPb09mrx2kuU92MaHPGMcVLz6b9M92YMtu0Cuo73Blu69INsBPqNavD2YmRy9bDqRPvybmD0LRYK9rK79PNsmhz2uEAk9jBAYPssUv71L3UU8gjUVvQYXMD5yFni9VpxMPeDdiTsH1TQ9k2/uvco1kT22q6W9Yjy7PcwraD7DT5085lomPQk+mjzC/5U4bIorPVTNUD64lf09CqKJPYiwHL75Vgw+Nve9vXf2hD1JUSQ+4vIhvTbcVTyyoLs9FHrrvVN24Du5GkG9cBiLPOCrQz6lCEK+YRc2PTLThT4MVtI9b552PetQRj3Vi2G+K0FGPgpa0byDRBq+5leFvjd+dT5Nesa9nhL2PSYBFz6rhjK+x1CDPiRqHb4D5oK+iDAKvjVg2LohUIO+6rhFvUuH/j0h+SE+lwz/PTi8eD57riI+Hv6bPHjcsb3Eg20+yV9Lvik0Fz7MxPM7M/0Svlc9ZT4zctS9FPXMPd40Cz4H8jG+FrYsviC7AD3LtJ093nf4PZhECj1pWYC9MH5CvgFUTD3MZUc+HQqIvqqKVL0mwcm9y6STvBD4QD2H8TU+GGkdvioA1L24iLi+mnbUPVMKlz40t1g+PZ0hPuxYb744yAa+c8vkOymgMT7tI+694cQFPg9AE7u4OxA9X+kyvsNyJz5Px/+8XPw6vRUAmr1Kga88rcLsPYDmmTyDLvM9LzP3vG/PpD4Yd8M94oEdvPXBAD4LnpM8Uo8SvZcRC73GpIK9AbqSPe40r7xnqAa9YpM5vipEpj3DFoQ9eps7vlCicr2bOZu+VYYVvTemMz6HFQu95OiYvazENj47IkY9a1HoPGy7qj3w46i9OXmzvXBZhLxetC0+R1eJPVVbKj6SCek9oqzBPJRqwD34S2q+4orsvE2JET5oqS29eYQXPjR4A76XSM06rS+rPX/OsT2oT+q94ryQvjRR2ztD59o9H1aovdD7c76kEA6+8RlxPjbRQ700oLY9qTGXPa4LPz5e9um9rhBfvlZMHL4Ghic+6Hd1vqNKVb6Nm5i+ickHPd+pkL6Nu+Q9bBelvo219j16T6K+k9mcvUfXDr6zhN49UQucvaLLKL1jwlK+HdcNPjzoab7yoaq9piGaPfgZez6TwHQ+wOawPd60Kb78Drk7Zs6TPdvenD2wrUm91QxIPRWwWb5D7v49/92fPlAjybzGqaM7pcCUvTZHED3U7p899h4QvkKE/z1vzpo+miwYvlCqX70RTgu+mkjYPnqQnb3bAc+9ReBZvZUOXD4fXJ895IekPZckv74gykI9PdeBvRRqTr7hSjg9M9aFPnGmTL7CAsW+J0Iyvrut07t2YCS7PTcHvkSV9Doh+RC9t9kvPjz0KjtyHpi74XMJPa4Jij1DJbQ8X3OOPoHBFz6b2/o8rlp2PtWRnD43Voe+lpCtPamvXr14OvO9sa9nverAsj01VgK97F0XPdhxgL0N+hW+26ZXvkqFX77p+5C+tUOLPQwKu73XaWk+Sf/8POyh6byurxY+3UAUve+DfLw20Vw+oGIMvdC/VDw0dBy+h+VsPYQX8D2/6rI94Mxsvngpzb3yzAS+ILEuPiGNlr6Bahw9PJC2viyRpT0lH6m9MEgiPiuSTb07kPS9OHXovV7x270OwR27pbhhPVTGiL5WYm++9Wk3vT34Wr0PcLm8soMkvsT8/TwQJJq9ZJWfveNQGLxSizq+B//DvOPSZb7NtwA+vYxuvXE4qL07/+Q9sdBZvo1B7L3fMrs9mYeTveqW/z3KXGy9xns/PmXMhb1nhh++6DyQPVduvry1t049ZiBYvMThHL5tCRm9tHNPPTtjer5q8+M9VLGBvfwPar3CEDI9ivBzPHyZ9ryw4ws80NuGvUg76bxVIiy+hZctvXZmDb7OSk68rYG4vZwuxr3lh7G93/+Ovl569Tvuec483uVKPPpUZ70AmSS+0CvXvbzun7rGbW2+ay9lvtCvED4Ff4+7s45fPufAcrwgPYi9vifTvFJcLr6yVaq8CWg6vmAEFb4LvYO85h94vgt5f76UmOy8gVLjPau1Ir7zoJC8ABJmPk0wf71JXxY9wousPWHH3b0+OXK+P2vdPfVXHz3GOE091nPuvdR5Lb6ZlQU9ftzTveZOST2J/Bc+ssdQvAjPUj37Ha291ICjve5uoT1YGWI9cecuvoSVIj0X12G+mA5ePSe6/DolFQy+1Qldvcv4/7zul5u9cIyzPCwPm73Tsdy94VWgvU11rr5e58q++hqDPan8dj2iXBk+iYYbPqb3Ob6LN069uaAdPlXr5Twpb/y90PEfPm8zTj0ZIrG9FNnSvVSr+Tw9Rkq+DjSxvhNKwb6XoB08R3sJvifVr73GQG8+6LWXPnvJsb4PS7o9TBWDPvsiYj3c/bM9TebBvD5OhL3TmaM9A2uFPm2yMT6n0+Q9dgi5PWeHAL5dE66+tsEavolmgL1O4pI+zqbLvapLWj13ESU7ycUkPX2ztTwdymO+9KCcPf0HOb59+x+96H0+vt/scT6EZ+c89JHvPcPRQr6KYBu+zaPzPeS0S72QhcM9TotNPSQsu72hsTa+JT3pOxntozy5RtC+S7qwuu85KD6R/Qi+EBlEvhVR9b0CgZc9GnkRvl4dsD7mWao92Bjxuw52xb5PgoC9fq72PPxDH74JjWK+mqC/vqYCWL5N8XU9mIYLvij4Ub1TjEi+zj0NvZzEhr5IFj29XfeePlrcsz1fzfO8CYSyvg558T1ebDc+Ipm8vcvIAj7CySW9t2U8vjxogb5nNxk91I5zPr81U76SVco9z2w3PY13c76dyDu+AOSju0HpIr4bCAG+6iKRPkjl0T0+3sG+ymTePaQpOr7LTs664Eg0vd3dUD6nx7E9VouKvlfwd70e/IK92MxCvUt0gzyYraE+U34wPrvI5LyJpW47MxsEPiKfWz1+0KA+xNsivp9mAr5FJlA9gVmdvlgpNz6pEAw+fi6xPhCAOL7CPr88/AlEPon9c72o+Do+YmqxvV/eBD7mQ3S9jt4VvryPtj3UyJQ87STGvVPcA76VRra+xv4JvjB8/j0DzTm+TBcSviwovL37Sne9VItzPgB3Uju6fji+oGqCvZ560bzH3cA9sre0vYRN8L4jWFy+skWcPeZGx7t2uSi+4WY8Pr7AcLxLAx69s3vCPX05871MNaO+RN+LvSDpN74zx5E9421OPr3CjTyYAWm8Y7gkvkhitb1XCZO92JWNvdiccr3WlUQ9T9h2PupcBz1D/xg9x207vgplN7578kG+mOQhPqBFjT5Ja2e9OU9/vnzVbb7wTlG+56iEPqi63z2sPZc9cpEwvWBOJj4WwkK+x9B1vN+PXr3649S84t4qPhMUibsCx7c+9SqCvtbYyLxRs0m+q4ukPLd1iz4ok6S9zQK0Pcm4uT0huz2+1ecPPu4/WD2M+6W9Y2wMvTDhRj4YcsC8txlPPpwNcb4PI4A9Fg75PB75JD5xTGA9oywPPGwzibtex9G9bVC9vT3p9j2vSQ+8Qi5uPYRrpb4Rz4Y9RedIvrlEUD5ODcG9pceZPrcoVzwnRh4+C4aQPYBf2j3yBta9md5Hvmnmor3veMW7Zldwvdkacj3jNEE92dWhPTfDOL6yTO08UCh6vV7a4L3q2JY8QgMhvhJ98D2W3489sRDAPWJCSz7b0V897PYevmlutzyQ9hi+90rzvFYgJD74/me+EOv2PZKGQr2iHme+fE3UvTApmr3pxpo9Vuw8PlASMb4awNG92IeuPCAANL6RVw0+9szWPUVhOzzvE/Y9EpOTPgY1ID0viqC9bUOKvbNuPT2rZte8ABYvPmaoBL5LR+u9RSNdvWIJD77sgAe+JNTmPd7Vgb203Se+blJ/vWULLL4BCzG+pBcHvpeagb5c97q9fh+4PLiBx72K7v29V3+fO3wsJL6oApG9kmAtvSpTIr4g05a96uEYPrnvNr6Mn9w6z3MQPWHoVz3lUos8n+ukvf7pRbw26K49t3sVvm2kvjxAuIs8ieimvm1Blr74oYY9hTievbvgkb2Fecw8GlJ3PMC8Gb1RkUq+PA8mPGUACb7YggQ+2i5DvDDumj0A8Iu+PIPBvTpkyr0qP7m8aANZvurmu73iVuA9LG1ZvT41cD1VFi2++MSpvRR4Er6thHM9dUCPvQPIqL78Wci9IFcMvuHGBb7dWEA8je6lPSxnAT4SkSa8XSJBPoPAt70wSNi9X1FNvq/rpLyoQaI9mno6PRBkHD4tOyy+AG+WvCOg073b9fW9tcZgvr2g8j1Omz29L17XPb+/Tr4xrqM9SYPSvXDuw7rAZZs+1oiJvbgPE77/3AW+dNYFPQsCdz03ik8+pdjOvhdSSL5CkcE9HBtePK0N5T0fNIG9/L0rPoEXAz4SJm8+peRbvnuUvb1dERG+ttLnvciVarxDr5k9YYSNvnWjNL3f0sQ9ezDKPlch3D3HEpc+c7ktvmvWTT5gKEu+A2VHPuNA9j0le4c+eQT5PdAaib2yOIM+dc2dPB5Lor5mqTI9GpKnPTbIvT2+zsi92S56PvO9tD6IZN0+4c/zu9mBA72S9L89yvGCvRU8uT3En02+5K2bPYImuz2dfM29wfqrvFG/kr21uKo8LJD4vWMjoj1cZNa72bW8PR7UHD6XRdC8dbY0vXc1072wCZU7mKDqvY1lhz6bgKk+9oU5vjgkG75CDBe+tlknPapwIr4P7gc+/aM5PgHAaT2VRKQ9UYNRPZabIb1xOS+9+vkyvvafw716txE9Vr8kvv53Wb7FZs89uTehvlaL0L5KTak9IflqvAA8+T1kcn29/WrhvVQCG773MV++YFs9PSpGG72j5Uw81FVBviT1lz4m5jG+e0VTvhp3ob3myH49Bp1lvsf86D6Jlc+9V8NBPUG4lr26sLM+1Dlfvmm/kz6jJwq9+YHlvVldET4m2LW+tM2rvdqvt73VjBQ+gOW2vWaasr6hDc+8QjApvgiQdj7YsQi/fPPfPegdBb2cVI69icyEPmeAwLtIg0K9374kPnLUNL17Tle9gciJvha6pz71tnC+G1Ckvl4Yqb06rpc9cZpCPjzGdz52cvA9UfB4PkmFCj5GZbe921NDPrpTR76b8g+/ROgVPgLsDj0duw2+NSxKPFD0Ab4qIce+rPnjPe2LQ72F4p49cCKdPgDJs71PEQ69dbR/vXky9rz9Msk+lzR2PmaYOz6ZiRC+/A1WvsrMhz3b+Ye+mloFPfY3qr3TY6G9vjiZvb3raT7DQR0+EL6vvcyklj68Ela9tUQ4PmewjT6o6pM+y1U3Po/qFj0wtvE88Ipivo9dKr5iPUW+velyvgFamz5r6+09rPo3vt51ML0pTV+8na2iva+lnT6TBT29nUQUPqskOb7laHi+nthFvlg3zL1ri5O+jnDdvfpIpL2Of6C9KHmKvqWr+r277QQ994KWPdA2Pz5aMsO4HgQ/PuxJBz5yBtM9O/tQPjrk57zJOMk+8OWSvIewGb3jhUg+5MPbPTW8rj3q1c6+dJCNvJGwJ76YDBm95BFgPp+Ddr2bwnw+3zo4PqOOfT3Muda+UbGJvno+kb69l849nhpSPu/veT6lLQc+ZhWSPp0VpTyVzF0+DIMJvSxAib35Ijm+6oCpvgjh8j2cIuE98fJ+vS9liz3rhiY+oOJWPtceBr/YwR0+HfUkPkSebz4NlkK+cvUdvrek9721K5E91KJpPtRnXz7Dr1I+QlhmvjcRhTpVQUw9g3aoPkm7+j0ElgA+Yh7NPg7DX75byTc+zBTQPU9GMT0+Nnw7JEy5vRYnxb27i/c8akkKvq128z0ReLk9ERdhvU9HN70MJtW9DnhRPesJ+L21zgi+mZ5LPUA5EL5bL0e+3FgPPr5END5vW+w9anYCvEPBsT0PJaI9YkoiPuWQXL2OPfi9hoNWPeiUhzxpf5G9g3KuvF2+3z1cl04+rSL8Pd8C170VWG4+hVaNPcuHdj3zUqA+OcW5vMoel73WyOQ9e7TDvZUwqr0oTU08ujNaPcop3T2YpwM+a7CXPho+m71ZWJU+OsFCvnyDKD6xlHe91o7OvTcloz1NB629E0nGPvTGDj1x8ow9FeJBPuJvBr3OnCA9RB2PPj4jEb7+Dog9e8k9PhU5d75q+5Q9PG46PgC2SD6J02E7fl0nPpkXsb0FSeu98ZjhvYZprLy+QeE9HHhsPWthEz0obpY9CgaxPfhORr5d22S+nUZKPousC752/yK+vJofPv9eEj60vKE9k79kPvAeEz43HNA9c2ODPYdioTzZQiu+ZbaUPaNi1D3BAZy9/r9WvoTAFj7O9sI9qhv0uz2kRbxCl2s+pmXmPQ11+TzBVb09xkkkPvWVR70hgYK9JyAgPuSv571F/YO7Wc/DvCFGiD015CS9DgtWPtVerDzDL/k9hdTpPbbUrD67pU++6rQavS/2tr52fue8X2f9PU3AhLyx2t69gHw7Ptd+VL72ZcK95/wZvoItv74+FC69JkiOvUNL4D1iPYw9/IbHvqRwvr6/ETC+GwNzPo1M0Tsamf+9UamqvdXpSr64o609Bt60vk7q7D0iJ+k7Q3eSvX+nQD7lwJG+qu3jvkMnMb4YaiG+1P0bvqNCkD3Gty47ccu9Pl9J0T1V0la7FI0fvbSf9D3/oDM9ILCZPdYRUL6PsiK9nPeLvq2CED7fKLK964W0vklVIT2MTFC+0UcmPVaj271YjwU+kikmPZ1nZj64ayW9aRvPPdtN4jsc5Yi9IwKPvpyCdD4lCPc8Y04ePXBO/j07ZyQ+q3+Pvi9DmL7uk8a9hM6NvmFQM72vExK+XRocPge9qr35mqa8rsGfvhT61Ls3MRG88QdvPlGU+j3lYYO9C8rJvdb4r74kypO9GpU6vgKbULyN8xo9jmGcvZlqur3eB+O8tHtHvuodDj41ZEk9w+AhPjchBr1tfxM+EXngvbDGJr073K491GCSPk1BEz4LPBE+ViipvlrOvDtxYQe+G+nOPfTqrro6Lno9wupzu+KsYj7QjbG9jFQ2vn6TSj7G19W+Fzk6PO+t7rw5STk+W8k9PVYXv71ySrQ91foZvStAwr0igW6+nFHpuvThWD22a6w9xMX6vor9ab39RJO+r0pfvtpscr1dNjU+LYp0Pl1GNT4tjJS+ehNZvjS8Qzw+Wxu+QsmOPr13Vb3A9Oa9+Cq/vS4RGj5b1Gu8wekoPXiEYzmRdIC+/vzqvEQear73Zl6+XFhqOutMqrloU/o8dNCSPvUsjD1F4oG9ckY+vg2orz63v449tLgSPtV9qb6jC0W+MP4MPst78r3qjYu9NasOvt/9Xj0JsQA+OsiIvcL6Sj4sfdU9ZdkHvY/MXT3q4CK8PBVYPRbRTb6x/XQ9y5XavSGMVb5Tkhu+/GEaPM9mQL4K2Ku93fWKPIiBKL2plAy+8sujvGHhiL63M1I+7BMcvl7Fjr7qh7y+3/ZLPmjdUD0UwD++VbeaPqYrx72NkMc9Tly0PcDct7w0FRU9u/3VvFez9b1Gg3e8vOqGvBC+iL1iQ3w8lidtvpcM4j0mBJI92RRXPm/thT7TqU4+rLAoPjUz+73z9qE+x93+PS1hmDz/NhG+WgGWPSP5ur0awia9ym2gvgQxwD3DsQy+MMKDPktnXr5s7rG9jWcBPolYn73nSs89s/yQu5W3Tz7cha2+BBdSvmfCPb06cL++jpJ5vjUOpDyT8jq+j3gOvbeeCr6elOs9dk4CvnGrfb2UEX692Ss9vjNgYD38CUe+JP9RPQWF/L2IDGm+QkXZPXnWa70fAaG+O738vYpBO75QRby9ilybvDBYVL5Pu3a+eFrYvYKUAT3fbJk87YVzvLXhizy3+409zkIlvfek7T2uSOu9PQVBvWZctrtlHwi+nHO6PWLBAT72NM89KNSNvuskUL5yT7A9AbuGPUcxo77+NEK+wiFjvXzLNb0g5L49gx+0Pb0GV7xGhdE9BfgFvm6kbT3F3gO+b3oEvpy2Vr3JDxq9fznKvXxYFr6hXfO9QXjmu9Mb8T3MmWY9lyu3vBV9Rr2LWo6+TEGEvQ3oLr5Icyc+ttvdvdax5D3IKi6+TJTnPH3hqTzy/L881zURvtUR/bwAk929nLoXPT8eqb2lSw++Q23VvdcBNb6z1mw+ux0SvegQcb6D0Ii9aO2Rvi/tUj09DA6+h2cfvqCbRLy95Ta9b/nYvTKWGr5SnDu+xfbpvPDitz0qSxG+sCY5Pc/Yyb2BU6u9/tIDvt6Z/Dw/sse9XVXdPL4Di706vEu9aA/zvWP3DzwbCIU9vUG5vRR5arxBexA+g9tAvgNrED0+05+9991+vFPr6b3Le9O91RgTPUBDzr3swpa9lLjLvH60sb315j6+yAODvfQkFj4rPES+ghmTvQw3Mb6BqYO+MaoXvJt71T0xH8Q+QnVQPeDCxjoBoDW92iWxPbASrj1RGsk8gC6NPpCI672keYW9z/RRvdjxor26HUS+A+qovLnWTb5LSDE+Sww2vqNLk7146oE+w9i8Pg6nj76VRQA+C4a0PUzxAL45Ymy95808PcJmDb59jpe+wMZYPi4QfD4t6u88t1wqPkRey73GqVK+NW+OvbXup71Pcxw+idtVvu20tL3t/gs+B/omvgcf770XQzi++J6nPhV7hr2O+bE+MaKPvqUIu709JvQ92mVAvQdInL1qKHI9e+DOPJHANr6ig/S7ndp5vcoPjb2dQ7M93y2IvPa3873Yerq+gOTGPdKxvT0PfwY+yBZOPbdCwb24UlY+yQ4MvfgWiD4slMA+AVQSPjgeZL0HlpK+ilMBPsFiXb6ZyGo9I9y1vLosrTy2os29rCCFvZ6FEj4UDiq+VoHjPbttBD3Bjpc9kuxfPofumb4SJ+485nXbPUNT/b0dCQK+A3hKPmQXIj6Qzby9Li3ZPbsp6r29Lc293YLDOuJRXr0aC1o+xOOovSWwJr7TyCi7/zKfPIrvcb5hcac9mWA9PlNCLD3I4JU9kTFzPgnPXL7Td4I+VoSavZa9UT5nZjw9lohivoOEoz0KDEW9piCKPf0gZD2Rs2s+23gVPfGuXD0nlUG8Lp5HvoZOij3BTIA+MJDzPcUkJD7klWw+fQf3PQ2Wdzxo3sQ9euJWPpcxSr0ipHw9rAMmPhahxbsd6A2+JhMiPpkUJL4+OYO+03yKvpTM273SWTC8ZKQwPd6/Rb4urNa8OeoBve7ipj53fju+ahduvnM2Yr1J2Am+CuW4vRpUjb7y/t68s4w+Pdy2kT211v68ZtwIvTymr76KK1++d+sAvpmGqLxgojO+Ig6vvamSqjxfSba9Z/W9PScsGL6sYBW+XJA5vo/ibr2vYwm+cCR3PImeCb53Ili9P/qWvYjyXL3gWkI9dpOdvjCYyj1RKJs7V5RQPqeTUL10K9E9edsQPsEftT17/7e+xeP8PJgrj74LBRa9XZNtvpqyJ760JLa9ZK2QPtkFW75RwUK87g4lvkaVDr7rQES+0ls2vrr6Cr6av129l4ahPSTWlj14tGI+/PM6PhmDDr7+ki6+ULjWPWumbD1+kg8+eViXvdkt8T0Svyi+7e7ZPVmc873a60c9TIE0vqyYoLwGxAK+q8a4vSUJgr6fK5E81S1OPXqvaT70SvQ9l/JvvjCzor4aOq29OwHDPCrbgD2qMFE+waefvQ6jI71nUuU9SBG4vQmvDb5jmLE9dONkvUQBZz78J5i8D5MIPnZKXL2kIpS9JcCQvryuirxBV509qeopvZO5kr00log8I+FavRQ1zbzSjaQ9nzIEvSZMCr4uwO+9VRRPvl8hKj7fl1G+dt1Dvvusxj3pz2a9cF8NProgvL28q9S9MThcPbiVGDsO4gC+EC15PR27q7xjuga9clD/PeaHSb7ozUu+6ZaFvVPGfj0qCJI93h++vRYD7L2xKUq9MA+wvU+zt7yb/Si8hM2uvZ24nz2TTeU9WZ09vjxSEL6qihK+Nu4jvST0KL3IwCm+YdSsvkxxNL4fOxe+n3QDvtzncr0TZLg90m12PcH5SL6FKJ09j3FCPuprrL0rQ3e+u38kvm0rjrwLARW+6zvzPfN5iL4Up+u9+B+evYnUkL7bJg++6BcfvVJ/Fr6t2qg93ikqvR9dwD2znBC+g/sdvg0nojz/7ke+C98zvaYtLr2+Jgc9V+J7PfnaE778hL09lCa4PdVA3bxJ6QY9mplyPSNzBL5Fxg6+Nu+fPblpqT0YAZq9gs/AvsQsBb6sLRu+pCqsvWYSQT0Werm9yJg6Pm8ZM70vkJK9FTwovQMNbTyLhxu+ZWnrvahCrLwpe/W9FoGbvZvAij20+MG9vr6rvll+K761xQ4+q97mvALxiTzjY2s7cSiWvApvLjufg3083RVWvnjSM77JECy+Jdn7PSOERb4tCym+II5Pvs0fAj7C6hu+zFgdPnmPDD39low8SeF0vTyigL7adD6+Ci/MvWrk7L07F8I+tw6UvkNc6LwA08A9qFiUPXlOJb2YTJ89xy6mvsyfQz74XtU9APDtvWn41L5Z7BW+NWhkPhe4TT6MRI899ILQPS7CAT4wtzE+kJK/PGR43z0rRpc+n2yFvjPl+T2U5HE7f9NJPgQS8z3EsbG9tf5APISiKD6E5LG9M5oKPQN5VryX1948PMw8PrpkbD3huoQ+/S+KvWieyr0cclG9iFSuuhM+M741a5I+ojqXPtwilz1j0Z898BSju5SyhT0zLqw9fDGTPaM5W778vpu+vvegvucgLb7ekRq8DHscPksoBj7aWPO8b+vsPSt/LL7kX4e+9PQaPv76pj1AcN29VJKTvupckz7XLSc+Jmwgvluqn77a9pi9cbdWO+VYfT40CHm92qejPlpKirxnj3q9k9EOPoSgCb7TBoK9XevkvIXQlb6BStc94sRxPRF3Xz6j0Ma9wu+nPgUcm75amec9MUwmPdHYvb2JmUM+j313vVwba76YA1y89vgdPoxEvruUKS0+GFiEO3k6ob7z01Q99Medva56/bzDkjC+dwxMPStQhL7MMgs+G3ADvvuoZz4VCxG+OkinvdtUwj3AlsA9sIKiPg71jz5UqBE9TO+yPp+Rmj3naEy+QFyXvjqRpL6x9KC+apSQPgauNz5diSo+40wAvrZAOr3eJo0+YxUZPjDsQD4r0y0+A/DkvSdiDD3XhkI9BoJtPmKwKz6CwYU913wwPVM8WD4xPzC+gH1kPkJGjj6AEwm9nrAJPSE3iz3/Vro7gIK7PITqYr42iH8+2lIYvpA59LqjKaq9e90RvpfT4713WIm9+AGQPpQ6n76ANEu+MMN7vsybpb0j6TI+tGvcPe0t0TzLGUC+7ZrSPdxvgL0ZrKU9lCAZvifxJ77Pjnw9b9h+PW8tkb6IkzS+r3z4PNRLW74X5T69vbFhvhf1MT0m+648V4yCvPTBiD4jocG92Vqjvgg4gTz3SSy+IqQFPuOjxb0xMNg9hLTdPMKGZL2Luja9r1kdvVQLg76yaWY9KGytvsBsKb1oO6K84Dntuxs9PT6YPQ8+80Iovnv05L1Gmu+9RQGAvnQ5D7stKso9ivo3PYhnmr5L8rM+VVOsvgn9E76ufAI9QmervWHppj0gW049ni8Rvhx0bT72iQK+WelsPh+mSj3JGZu8ZJs9vQN7sLyUW4++KsUlvYlDcb4/o/W+06J2vj5Qg7vLBaA9TSvjvUuBaL3B62w7TVNiPnhl8r39rgU+g4wXPrCKfL6O8dc84DTIvt+7OT6X6zw+6oolPrv/mj7KNbW9we8MvX0F6bxaCBs+tWNbvnxvNrwwUh0+LZDdPXnSZb4Gm8O85Hplvd4sOb6CRCy+wLU5vv0fGr7LPYI+Yr0YvjJpKD0rcty8nbnfPYck+LuTrSi+BuIQPjwfrD38Kbg9MAEEPvEJF75Hywm+eNdHPaDQur195BC8hTmFvThBQr2tsQ6+2Kqsu3LCrrxiuwA+gyOsvW2wCL4xRiw+Mde8vOnoxL3n/ME9/vRVvgcjtD23I6q8ou7sPXaFr71Lzxk+xlNdPqdRzT20A8U8WeP0vPH9gL7VIE6+tbR7PQfaVb4SPsa9EjN2vNqqbb0ldYu9gNZLvbZC0721nF08w9sSvWiaRr51avm7Qy+xPCsKB712l4E9sORCvprVB759ltq9nBU8vWEbAL61jCI8uAdBvfB9Rz5Jh1E9XmAQPstNK72zldW9y68dPi+SubynnjW+vGkKvsOSK72SdrU9cY2rPRnk7r3FU/a83T9UvYXkVj3UYvq9Nc4LvjWf4T2VZSK8B5TKvQHmSD2reOy8ivQtPWf1J76h8iC7WnO0vd7xkDyJwWW+IQ9/PWDujzhcoFU9n1IlvUUsSrwbxpk9pc5pPtEZcT6rVZ29odvlPGYM9T2vUIc9FLJ2PdQnCL2QrcG9+iNlPo928b3gtY27mo2PPRknOL5LRGs9oyhUPrAbiL4AkB29iTM1vVCyLD1hGIe9tf0GvTmx1T1B2RG+GT+2vcAKsr164xu9F/kNPQUEZT23pUO+WXcSPm1ySzyioZ8+POUHvvFOuj56epe96UKgvmk6eDtIivK9GnD4PYahD7694Ku+EsAyPqNN9T0zphw9L8SSvqsutzyFY9O8CJ9QPkQjkT7lB4E7Db4RPkyfJL3wc6w86yRrPtROmD5mtoY9R64SP2kqlj42nRi+2A0LPmCJBzxBm4U94AWsPfAAGj6Tal0+4h6Avm1k3j4WD+q9eX0bPhNSCj2Jjrq+SqZwPrypDzr5GWS+dEoLvjO9yD3ivhO+Ob95PrKcyb3ds9C+SRJ7PmBtm70fa5O8C0yLvkKVOL6pXlK9ZNuivn3X070umIe++hiiveMTBj5kA7a9hlkgvhiBoz6lnJI+5fCgvpVRcT4PtIU8pBsOPResSb455hK+VDCQPnKwvr6K6je92U7NvnroW77g7yy92VQGvo/L9L6tzbK9BKZmPYgiv72/3Bi+iX2HPhYhcr5Y+Yw+xNmNPWwkaD0d9II+VaaYPU0NiD6S+C2+vtTuvcODbb7ZwNu9Is46Ph1v2r5Dw0Q9ad1gvA5pFb7DipW9+oKGvTtYzL3iSDw+HLkqPkohqj7JpeG+rf61PjTlwr7vVcw+wEb8Pa7oiT49lvo8iKC5vYf9PL7XtpM9EVorvTQXwL27QOs+8U9MPonEBL5XFTs+rbV4PUvKD75xLQ09GfkuPcegcz61Hpo96yETPQ74Kr7xxrk83gdnPnzCPr5PtWG+zGg8vcIjKD5QqqY760M5PcoRED5kqXS+sHeGvXcJdD6/H5S8LWhWvvv7fbwZ+52+5tWYPHNsAz5yoem+Mp8Pv+7Lnr6Rx9G+DyvjPVMLtb4Rq4O9P7hRvrgphj1RbhU8UxuCPRGgTL4I2Oa9Gcr+O0tSnb3Yn6K+k4VEPgTtBj4XFpI9BpuvvNvzLj1yuZe+CMutvSgkhL5L/6+9g2R2vgq2m73Tj9o7uokavjVWjz3CVOS9wHhdvrcErj1ZByy+lZW2PZ2RQz5nC5G+nZTKPHNt+T0UJ8E98ZgTPrkLFb313As9rIcovTVQubwzuYY+Uk+xPlOmBj6uyrQ9EMKuPeZu0r6aO6u+x7nBPTnLzD14prS9tswRvrL1Er+PXS6+ST+aPjSKAT75bRm++hoBvg8nez72rdG9X3QeO+2tXT5bRw+/CM1PPtObCD6YhCM+L8QWPmzJcj68Xnq+GGPuPapuSb6hY/y96aOPvpdxhj40xYi8CZ4fvvrRuT3yLB8+Dqyyuj2tWr3kN4k+k2MIPtXZ7L4i5yu+cTiRvs/vqD2J8yI+pcalPg47XT2y6Yq+6IbiPt6AGT6FV50+M6ShvjWdpj3/SA2+rd9jPW+RwLzWRUo8JTj4vpJXd71Cv8e9mxgovopUAD7nwZO+bHszPUggvr3yTOo9BAsyPnFTE75/OlS+eq0zvQhwpb1n5Iw8DoWnPqV/sz2mY9U9+QYRPqmtCr7dkPk7wCycPVhGxLwE/Ii9YtHBPaRPqb2x9Mk8rCAWPYUDlD3Jj0092qU2Ph8W2j3yQn+9rsfnPJv9Pz57WOU972Asvt/GIT7rV+y9VV/mPVmAAb6x01a+f9S1vbI1S70yWhM+YS6jvLholD0yJji+uNAHPLhPK75dqw2+zE6HPKYsDr5E9a492oWovUizgT4dY5e9dwOlPa7GJr14HEG9H71SPT1cIj0Ub7i97MTXPZmWkz09RlI+CEyLvJefPT7HD4C+Qj6KPbt0UT3k99w9yKYqPavsub3kzJy8n2ghPo1fcjv1ABY+X+iDPt9rwLxLTTa++YqtvbeHE73VzDg9SAtMvXiTG7snByK+LkWIvVxNLb4Z+pc9uUM4Pm5bUL52HWc9jGJ5PZ339r0qP++9nICgvafIbL4gSSa8QSphvmbj4L00Kdy9+W2ePZOjorxzhLA9vkGjPXc2Dr6wg8U9kkk9vf9aCj3KQzA+0fMTvvMS2b2j7xs7rPMpvQsQr7uI7ym9V6/ZvS+Dpz3apsU9IchYvpczl73azha+xeFrvItiaz053IA9m3CPvRjpury44r49dOL7vUuEn72D5EA+KW8fPpQNdjxdMuo+6N/9vbfyiT63wQQ9Hm5TPrw6Ir0vkWU+Ag8Dvinax76SlxS9wSDSvQPJjD0DrMk9s1VEvejt0T291Ds+6IF1vYR1Or5vGs28rb4JPoVfHz7T+GQ+ZiAPPkJ7bb7hnKa9IPcXPqbFiT7Xick9LSW8vHWLBD5Zz4u9yPmAvvxQWj6iE4E+jun2PbGg2z6KES6+WgIOPtfxij64MI4+iDNRviYxsj4FOvk+h6A6vqi6Nj6jNMC8g5mFPrG2E76NIJi+M0+FvstntT6fszM+68O2PCEo0TymhBs+21FrviBNnb6qioY+TIVovsfP5r0B2OO+XdOpPHoqvr0WpAE+VwVxPtJtd74qFwW9ShSrPc4tG76bZ8q9KRCWvpTbHb6U7nu+Q6nBPi/AAT6PDKE+RbKwPn5Xzz65VdG99pWFPBtDLb4bHJc+5XJbPvPSqz5faJ69sCbnvRF19rloi04+TL/xvWunEj0QRVa93Uk8vuJSmr4uqiM+zxxtPswztD6CoZC9xSQqumSSFj5+lhy+pfeRPcv6Tr1a2eS9826UPry5n72MkS++FOO5vbyWAD5gXXw9S7K3PggKWT7EiSq9CJo+Pt+a/z1HCZo+cm+6PMVglb4YSxI+nHC0PI6XAD8HKbG+eT2tuYsDgr2gHto+FtfwvLe5cD6YvU++weBzvWH5uT2fmfq9WU29PHQ+QL6PDCk+w4TXvQQQVr3g4YM+MxS9PjXEeD7VP6O98Nm6vHS8lj2+Jto9rS6kvtKzi70EN4C9MpWfPYqDYbyZVOU992xxvSq1ib0uQai9ax5Lvgt8qb5HgFs+DzhfvkSuAbxgTbo+DAiEPaJHeD7/hrY+btAVPjZFyD1jCxU9ftGMvSRcHLytwIc93oxJvuiyfr6DCwK+ge7sPChbXz6Vp8K9zLsYPt2pLL3d33o6XeHZvQGc4j1x5py6xJvIPR3WNr4OMw6+rz5iPcJwuT1W1Dc+JOUCPvoYBL4kC88+Wtr2vWt7nTyEXlO9ubkFviw/fr7dZ8O9unCWvnu3+j2KIOG8/+DbPQPMwD3ppzy9y9cTvuDWwby51Li9X5qVvTvcl70Rbwe+2/U+Ph4iKz6kbgQ+a1/bPWF4Tjxc47y9NUc6PtftrD1ESxE9dCEvvtkWxL5JigE+zq8PPggwE75nA+k9I5WevW9ojz1ffD4+UvAdPgYsMD4UQww9Mc1HvdW/O70Q5TI+Z1LoPeltKj1RKw6+el7GPVcdtr6mtde+LvkBPty3vD6s2X+9mD6nPqqLjb3O/F09ukFQvtNSET7Pn8A+OFOcvi68A743qGG9u5kmvZYJ5z0nQeE7/yh1u+yRRj35bj08/bgLPEgiKD5cuBa97PicPRvuCD4v6gs++g2VPLzJGT6RssM90TznPXvpST4lTSs9gClFPnEW6bxo+Ms8zK9lPrvSM74ibWY9ZcsVvUEaoD3NqNW9YL4TPiveDLzIMYA+vdCLvC6AyDsE6CC+wwooPb3b373PQHK9tY5IPh8CDT4G0cG9Y5IhPpzSjzwzreg8gRxYPmU6Kj6Fm9a9ifPOvaGWwL3lELk9c/q2PXuNnz37C+I9K4rhPST/lz0qcYW9Uve1vR7MVT6Q19+9XPjsPXj95r0s95Y9Q4orvUyFVb4V60Q+EJMXvg1shT1cJyk+MHTZPclMbT4QnTM+T59KvSfnAz64BP+9J8qHvdHX1z02IlU+T1YAPoN+m73ekx6+n+UgPZFxMD6aIok8jt2gPkXiPD4u6Lc9YcXlPYgL+b2RqC49xmS0va8T4L3YhlS+UgeZvXySIT4cCbm8aOdCvCLcgzydOws98+GpPfqw0T1C6gY++GEPPlydoL3M+LE9N+WOvZo6Cz63cYw7/SwUPrcbCD5BrEC+bmEDvdIqAz1ZWzw5XdoqPscyMD6odzE+BZFKPqQcKr2iQjE+1qKfPpiALz5p7zE+N/oWPgS33T0eJka+9WIpvsCuH74AL/+9zPP7PaVkgj01Mza+U16svT2AxT1etxk9Xjupvd69Wr7pMFC+t7+/PWQIsruKgCY+jKunvWFVrT2OnSM9vZHFPkflUj60UJ89y8NYvrDSvT3QmyY+XXsWPhOB/L252IU9dbXEPNqnFL6L8x8+0XKEvt6VCr4QAYA9yFCsPYQtsb0rOYg9q7iXvbbqEr6ky5q9StDhvkKlH753oJO9VXwpPWz2yT1U6ey9yYXMvfpM8r3ixvW9SBxcPq5FRb7dTG8+1e1SPq+Vw72CiT6+yMLDvioq9b1NSKa9lMTRvTVXsb5El3e94L3LPjEL6zuJfzI+WhSzPRrOuD2yCMO9DRAuvij5Dz0Vthg+lvsavfKXGj4wMMy9NMvYvlSHGLxwJkA+S90RvqctIL5sj+U9U+2bPlCHtz5umq++EyaNve4Zo75VJWW+zobNviv2pz4MbUo+S/9CPjNrODz+uJy9KOZPPLknrz6moU08SnGJvdETAz0nCIw+MVCrvZX2UL0q58K9LdTpvBxNBj5I7oG9X2BUPvpwE76tcvu8Lk3EOzFgmD6AJ5e+v6a1PQxUlj6sza09aSoHvmkqQD1gFuC+TpI4vXEyRzzVQgG+vU+nPMCj871aLEg+a2fXPeQ3Mr2FJ4+8sIaVPU3QTzzQChW+wXJYvrWvET4Rsx09Gt1aPoWPCrs5Gj6+OXuUOw/SDL5CQC29/YMnvhpEGL7cFkW+dGIBvl2MhL6fVg8+W24qvjnetb3z7Ju9OLChPiH54r08j58+0hknvRbFOr4b+Tc+M6y/umI2sDv10eC94rVTvuqvLb6JSss9evkJvEn/Wz083tG+KkeWvosoXb3OP449dW9dvsJPnb1tPp49ExQDuqHRmD483rm9zg4PPh6IXj0JdGM99ijCvczZdL5sCiG+tGkqvt4lnLzl/p69ils1vsDXDj5qNvw9s3pYPs7A7T3N5Zg905xsvs9BgT6a+687kM0FPXGxGL55fnE+MXSFvHOcCb18ahM+BCWvPsX6jb7l6/m9gOXCvcP+1zwpqqK8W/dFPdzL4z1CW0W9vobxPfIdjD7i25c8/gkuPi5QSr6jWoq+W2/MPqqGKz4P0ce9gMZcvev2oL76rto9FND/PS888D3TVqa+1+GKvUw/xz0GS029NmERPh3DkD2Co6m88mQaPCoYOz51L8E9mnvRPXnaN76SSBM9xQVyPUFWh742WZk95+GPvU9p4jwInnw+lIsrPdnM3z09s1A+ExW/vdMAJD4ZL2a+nv4pvqpV/zxRCsU9ZwR6PTXq+j3pRBo9Q9B6vrT1dj628kY+mKiPPnjReT5xXwS+ENc6vhw39r34vAu+sc+jPZnXh70DWEQ+Im4kPr/HoL4tFR2+sqd0vv7CqT77iu491DGnvfiUqL4XMRG9kGezvL7MAL2DoLk+r1SIvlyvybyIWfS9P4Uuvuskcj4Cg4U96sQpPrTCAL6uD/C84eqfPntNJr7K8pG9ijtzPmCrvz4gd/m6OV5AvYbz7j05Xsk9+9vovdFlNL7myhO+d7FXvg9siT3SaSk+hDwevbUqcr1Wii0+QU5nPo9eHL7xQq68hTcwPln33Twyj6Y95zMqPp8cErootzo+t7QKvZ4uVj5a+zs9UXQTvsopiz2yrz+82YeLPjr7gb7aj5m9Y3EPvZeBoLxKItm97BN0PZZQ5L0bIte9dY+6PZaszr2Yi789F16KvR1wBT3Zj7O855MCPKOysj3jB+Y91LCQvZkWLD5onD6+iT+Lvb2bTz5gWk69NAtEvYahBT3IDiy+zhzXPD6E5L3+hqi90AGVPljcATvxDy++TnzFPFNjFT3uLhC+nGmpPGy4db1H+A09om1MvnAopD0Elyg8eyC9PSWMsr2+98U7GYpnPSmREL4TMCu+QnVPPfjukb1Xtzc+q4jDPWedUz1ZhS+9LTglvoI18L3Lv6W9JHvyPJ3gXL1pQxk+YBmBPleGILzHlmg9iTSzPQxu870RaSc+WyAwvodRaL6V3Ee+nabWPc+4i77bFeE9wmAQvqoR/TvgLWI+e8MgvvMZX72gpra7xGmnva1TYT1S65Q9qpv6vYdGSL7aZmC+WgQHPjKOBj0moFY9cvjFvZ4zUT5Od0w+boXvvXbJMD0dCRm94QnQvetOpj5BcUq+lxIRPB6d+TysSeG8fJkavT1Ro729yh4+soUxPpGmgD5h08o+jp4+PYR7CbwcivS7BsaKPUCqQD5KYnK9P+kXOwamjr1l3Vg+9NUEvhkYdrxig00+YvwsPoaygz5dVbg8RADVPthz77xwUqe9K9XiPnrHWD4rTLI9iphOPhXpzb2c0BI+yCWCPYudZj73q1u++l0bPuvf9T0mWDW+iUKTvXuHnr2wFng+tX2WPXVMEz005OO9OdUIPsGgI766CTc8x+YqPcdvEj6xXMa9nrmyvdLsPD4T1rU9oDrBPdMiH76HGSE9GK9AvlXUNTsQ/AY+HDGfPnpTFr7R6Yc6FVKBPhqPOr7o1E49Xx6+PrqqqbzKZgu9+BiCPh+xZr5f43O9jEyovtmRgz4maQA+t+t1vgiiYr5KlXs9/0BJPXxckD3wzJ+89BNbPoTCQj75pGM+4G7/vCXZoT307f292bHOPbuVYr1pV289kpROvSvo/zyNENO9yq0tvRLm7z0wyUq+Iw9rvo/5Lr3A+3Q9cucHvVotqz7jqKM8NJshPomz3D1gmzs8ay8WvkSMYr0G1Bw+u4dIPsfFp73MWio+9lfovHN/Wb0yS7s+IrpkPqszLL5F0ms8i+RxPh5rGb6uXKK8L0yjvSYIHD3dOkG+dvXjvV1GRD6TDBM7wypQviInRT6LfVk+nCPSvMceojxZ4g+97fiWPWA6qruNgBw9RzbFPRWndr7myZA+GJAQPs+13D3BYHI9ZqugPhflDL4ZWs09YrvXvYqaDT7xTam9KOZKPmLO2TxMghM+LiUnPmcunD739Qg9tookvVTWTT7wXDO+ALRPuoohFL29u5O9US1XvWczsb7xSsC9OLSguwqd5rzUEz696BJMuwO/yD39b1690wa1vukSAD2jq5A+lJaTPgB9Ar6z1Di9bZtsvfNL9L32rzo+nAA8vnGGj73TJqy8Z22GvTT76T2Lt9I8/amGPEZ1NzzvGeg9bUPmvbuIKj6iZTy+5k4EvtsjyrwEcZ++/VHBvcI1cr6Yrcq+iR5PvmTWoT1oroG+6xyUvpMb9zzmCRC+xj8MPsLm1zwHoUU+qOchvRpqDr31WIw9hm6TvRyMIL46Vo27PAOFvn8kdL6xRIi+vllIvtnfTr7stCK+2poGPr/hID2IUTC+AoKKuhztOj2yh0C+oDuHPguAZL6TfY29Wh84vkNNlD3GtVe9dgxhPqfBSz62vRK+KqMKPlQFdb4GjBG+oW+7vRMKxLx3q5w+/LDwPQfb4r1CfgS9+4ZqPbTWc74f2wQ8fJRUvdLs4j206wI+NK1TPStlnr06/wI+idqGvU3U0TxV4Sk96JotPgBMj757vPE9r5cxPiC9Eb197Jc9Dr40Pjx47zzEhBo+jKn2ve09ID7FteS9BIvYPLd4x7u0rOs9DtC3vLEYCr0Jb629JglSPhhjOT60s4M9/3ZdvpoQHD77IsA9E5+QvTv9Rj4UYDY+yqpDPewlxT1UYH29RbaMvMhyA75WqL47WDa+vV0CTD3pF/e9xfAYPmIrJL6Jbso9Zd78O/uCqD1CbQq+phc3PqnonD2pRA89vKq1PauwpbzuwIW88cirPYJ2NTy9AiE+Aec8Pa+eIz61oz07vfqfu7yyzDz9Yzu9RK1vPSyAq7vcD2a96FghPuAc9j38LY899BlZveUBtT0D72G9CBmFPhVror2W6xy+SvshPmBudr10JqE+D3g+vqwKDr7lQT2+42nwvFVKZb6ACvy8pMyRvd2Sg73Tah4+umUwPt1jpD1SQNm9IOxjPaHPir4MrWy+KitRPV3AA76Wcs89PacNPq2GPr7wzpq9aiz5vM/gcz3wqQe9wFt9PpY7JT6kwKQ9R8A0PjlgnT2ubaS9m4h9PX/dcD47nce8put4Pe8/Az1D2CE8TN/iPR82nb2jgwK+qm4LvjIMAT5ImW09cL8Svn3UwDxBoUA801MNvLiUfT1ZiyO+ZC0DvqEawzxo05I9bZ+gPfMjcL67xac75gGOvZypiD7MeV0+03mLvr6ygb5qLbq86cOxvlZ8RL5QP309j0CJvfxscj5OQqU+BYBAvm2qWr6qm9Q9gpjvvustxj5v7io9aKZqvrCIUb18xf69M9OhvjqmEb57hoQ+6cImvUlZzj2+6g+8vluivS8rTT6mrq29APeAvvi2m716iEc9dDq1vmudO74bBX2+xoFuvRk0AD9G4pK9zGK1vgBJDz2grhy9YBJtvhiHMDpDs609opfrvSNssTyA4149bZX/PZIXED6f/Ym9malSPrcn1b1hvW2+e1RPulU2Ir48eI++gZuQvSWjIL7Ua1o+ITIuviannb1Ozsa9h0AGvN3tIzv9dL29E2iOvV41TD7nqEk92egVvhEeH76SBlA9l0W3vBGRED4hfLC9Co2PPSuK/LyCrEu9kIdtPcys4D3Ae6K9A5ABvv0FFz0XY109f9ZEPu3COTuDpqe90qCMPSw5pL0Wv6g+2WVdPcC+M7228TC+1uUrPrvN2TtVkpa+op0uvfwljL25P2i+tiMsvoEvQ75VoMA9nFIEvWGhjr2xqAo+nsizvCZrZD3KvM09usraPOqOnT60TdO9U6afPK2Reb14Sc++EmtRPlc6u72cdUA9uxv3vuDnAz5VEJk6By2DPRSmBj2NfEs+QEYGvukYYL2znC6+IlJXPmYQBb5QLh4+MhD7vr7xqr2rWDI+CHegvQmjKr7mhL++BgEQv/4dmL0FAoQ9DmtuvrXVx75bEq6+AKOIvpjbYT4atJI9LfI7vkzkCj3eLKA9+82VvYMO5bxWhj6+s1OEPlWMkL3hEmu+JdYVPIKUyb5891W9inGMvpNWt72Eg2Y7dsbEvVfrDT4zZca9fIugPn8Qob7GbIi+3MWsvkqQ3T1LXeQ9xtH4PSGhT7zS/oQ+6fX3vXYPk76f2J49q0DrPL4xyby0BMo8LUcjvi+qVj7TEd+8R5b7vV0UWr5xpQO9Gh7bPVYwLj6zZKU94HzWPUtKi75TUny+LlSJPnFZY71cMGW9UobaPenGkLuwIFI+KNEFPpnNC74xFLa+/YzsPdEhBj4IYhY+fZouPl9aE735PMO+cny0vRnAdT1k6E0+IaauPUQaAr7VECU85MTxO3nrKz4vQTS+QSohPmGfqjohD6+8HvoVvTNnR75Pg4s+dOoavrWcKD5D1ji+JoIROwASBz5jp0w8I4QfvjV91D7ZvBY+6RZQvj/Mmj3jivQ9VhbOvVb97r0jmx286tE2vE+YiL3502S+53U6PfLRZz1v+Oa9w2O9vZxDeL6ME5q+ppZJvuQ7Uz1l45c+3cQdvkQ6Fr8FVEG+"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "sequential_3_1/conv2d_6_1/Reshape/ReadVariableOp/resource", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}, "tensorContent": "DIqDu3VR4D2VN729YrGYO7+fgb7tinM9cza1POLeur3PPKM8kdJcPermMj39ty47lGIwvlouKj1wKny9bGMOvjCSgTw2HAS9vStBPHglwLw/3mS9zTt2PbL3r7wMOnE7mqdUPbiWhjxZr808ukkDvmI7dr2xCo49T5OYvN18MTxDvI098mTkuplpgzu0Mcc7wo66vQb+Y70JBrC9N7rFvI0SSrxZgV09jDL4u9CA9LyFHWS89AvIvSgijD1uRoO9WFfXvNI1ST22WpA9peAjvHBuw7owm5i9V7iSvQ7zy7wUIL08uG+BvRS2y73Afyu9J4gJPALQYb20OYS9PnLHvUso2b3b60i9wiLivYz2i72JHHY9FRASvWiYoTtfhjk7rU05vEBDCrwI3WG9FM09vm5CjL0AlRc7gjxWvaHYDL24qg2+ntocPe6oCjxyG7a8/7LqOxKeEjxh8Y69r5eqvY5tIL6s3CE911JHveCisL2U3hM9Kh4WvhPV1jy0GPa8a+4ZvTaXgr0Af4e9UO6NPS6s6Tx+bHG+Cq59PfcsdT2+h/C9TgVDvBAFwb3gwMm61MH1vXpmFTxfYnW9u7w8PTEfi7yB3qW9H/47vpu1Qb1TOIm93maMu6P7nLxqsiK77xlEvesPIz1i4J+8LZJhvnvXpj1rAAO9K/sLvel4vTw="}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "sequential_3_1/conv2d_6_1/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AQAAAAEAAAABAAAAgAAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "sequential_3_1/conv2d_7_1/convolution/ReadVariableOp/resource", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "16"}]}, "tensorContent": 