{
  "format": "layers-model",
  "generatedBy": "export_to_tfjs.py",
  "convertedBy": "Custom PyTorch to TF.js converter",
  "modelTopology": {
    "keras_version": "2.13.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "tictactoe_ppo",
        "layers": [
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_0",
              "trainable": true,
              "batch_input_shape": [
                null,
                9
              ],
              "dtype": "float32",
              "units": 128,
              "activation": "relu",
              "use_bias": true
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": "float32",
              "units": 128,
              "activation": "relu",
              "use_bias": true
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "trainable": true,
              "dtype": "float32",
              "units": 9,
              "activation": "linear",
              "use_bias": true
            }
          }
        ]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "dense_0/kernel",
          "shape": [
            9,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_0/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/kernel",
          "shape": [
            128,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/kernel",
          "shape": [
            128,
            9
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/bias",
          "shape": [
            9
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}